--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Log
>  file_Empirical Analysis_Final Version\Log file_Democracy_PolityIV_TSCS_Oct11,2020.log
  log type:  text
 opened on:  11 Oct 2020, 09:18:43

. clear all

. 
. set more off 

. 
. pause on

. 
. use "C:\Users\Muinul\Desktop\muinul.democracy.dta", clear

. 
. global id c_code

. 
. global t year

. 
. sort $id $t

. 
. xtset $id $t, yearly
       panel variable:  c_code (unbalanced)
        time variable:  year, 1789 to 2020, but with gaps
                delta:  1 year

. 
. xtdescribe

  c_code:  1, 2, ..., 397                                    n =        397
    year:  1789, 1790, ..., 2020                             T =        232
           Delta(year) = 1 year
           Span(year)  = 232 periods
           (c_code*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         5      46      61        76       121     232     232

     Freq.  Percent    Cum. |  Pattern*
 ---------------------------+---------------------------------------------------------------------------------------------
> --------------------------
       71     17.88   17.88 |  .....................................................................................122222
> 2222222222222222222222222
       50     12.59   30.48 |  .......................................................122222222222222222222222222222222222
> 2222222222222222222222222
       37      9.32   39.80 |  2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222
> 2222222222222222222222222
       20      5.04   44.84 |  ...........................................................................................
> 122222222222222222222221.
       17      4.28   49.12 |  ...........................................................................................
> 122222222222222222222222.
       12      3.02   52.14 |  .....................................................................................122222
> 222222222222222222222222.
        9      2.27   54.41 |  .....12222222222222222222222222222222222222222222222222222222222222222222222222222222222222
> 222222222222222222222222.
        4      1.01   55.42 |  ........................1222222222222222222222222222222222222222222222222222222222222222222
> 2222222222222222222222222
        4      1.01   56.42 |  222222222222222222222222222222222222222221.................................................
> .........................
      173     43.58  100.00 | (other patterns)
 ---------------------------+---------------------------------------------------------------------------------------------
> --------------------------
      397    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
> XXXXXXXXXXXXXXXXXXXXXXXXX
 -------------------------------------------------------------------------------------------------------------------------
> --------------------------
 *Each column represents 2 periods.


. 
. * ln CO2 per capita

. 
. gen lnco2pc = log(co2pc)
(30936 missing values generated)

. 
. * ln GDP per capita

. 
. gen lngdppc = log(gdppc)
(36137 missing values generated)

. 
. * GDP per capita squared

. 
. gen lngdppc2 = lngdppc*lngdppc
(36137 missing values generated)

. 
. * ln Population, Total

. 
. gen lnpop = log(pop)
(28445 missing values generated)

. 
. drop if missing(co2pc)
(30935 observations deleted)

. 
. drop if missing(lngdppc)
(5929 observations deleted)

. 
. drop if missing(trade)
(329 observations deleted)

. 
. drop if missing(pop)
(0 observations deleted)

. 
. drop if missing(urban)
(9 observations deleted)

. 
. drop if missing(renew)
(201 observations deleted)

. 
. drop if missing(forest)
(100 observations deleted)

. 
. drop if missing(annexI)
(416 observations deleted)

. 
. drop if missing(island)
(0 observations deleted)

. 
. drop if missing(latitude)
(22 observations deleted)

. 
. drop if missing(fedfof)
(0 observations deleted)

. 
. drop if missing(polity2)
(2591 observations deleted)

. 
. 
. 
. xtreg co2pc polity2 lngdppc trade,  re vce (cluster ccode)

Random-effects GLS regression                   Number of obs      =      1560
Group variable: c_code                          Number of groups   =        67

R-sq:  within  = 0.0458                         Obs per group: min =         1
       between = 0.5094                                        avg =      23.3
       overall = 0.4846                                        max =        26

                                                Wald chi2(3)       =     33.93
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                 (Std. Err. adjusted for 67 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
       co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |  -.0007121   .0189123    -0.04   0.970    -.0377796    .0363554
     lngdppc |   1.411741   .3322676     4.25   0.000     .7605089    2.062974
       trade |  -.0024286   .0028015    -0.87   0.386    -.0079193    .0030622
       _cons |  -7.313093   2.891559    -2.53   0.011    -12.98044   -1.645741
-------------+----------------------------------------------------------------
     sigma_u |  4.7279565
     sigma_e |  1.3064176
         rho |   .9290646   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. predict e, e

. 
. predict u, u

. 
. predict ue, ue  

. 
. kdensity e, norm

. 
. kdensity u, norm

. 
. kdensity ue, norm

. 
. pnorm e

. 
. pnorm u

. 
. pnorm ue

. 
. qnorm e

. 
. qnorm u

. 
. qnorm ue, mlabel(countryname)

. 
. predict e1 if countryname!="Qatar", e
(16 missing values generated)

. 
. predict u1 if countryname!="Qatar", u
(16 missing values generated)

. 
. predict ue1 if countryname!="Qatar", ue
(16 missing values generated)

. 
. kdensity e1 if countryname!="Qatar", norm

. 
. kdensity u1 if countryname!="Qatar", norm

. 
. kdensity ue1 if countryname!="Qatar", norm

. 
. pnorm e1 if countryname!="Qatar"

. 
. pnorm u1 if countryname!="Qatar"

. 
. pnorm ue1 if countryname!="Qatar"

. 
. qnorm e1 if countryname!="Qatar"

. 
. qnorm u1 if countryname!="Qatar"

. 
. qnorm ue1 if countryname!="Qatar", mlabel(countryname)

. 
. reg co2pc polity2 lngdppc trade

      Source |       SS       df       MS              Number of obs =    1560
-------------+------------------------------           F(  3,  1556) =  674.15
       Model |  41784.0522     3  13928.0174           Prob > F      =  0.0000
    Residual |  32147.0562  1556  20.6600618           R-squared     =  0.5652
-------------+------------------------------           Adj R-squared =  0.5643
       Total |  73931.1084  1559  47.4221349           Root MSE      =  4.5453

------------------------------------------------------------------------------
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   -.307126     .01868   -16.44   0.000    -.3437665   -.2704854
     lngdppc |   4.994593   .1136876    43.93   0.000     4.771596     5.21759
       trade |   .0034282   .0024915     1.38   0.169    -.0014588    .0083152
       _cons |  -39.67432    1.01263   -39.18   0.000    -41.66058   -37.68806
------------------------------------------------------------------------------

. 
. lvr2plot, mlabel(countryname)

. xtline co2pc if polity2 >=9, overlay

. graph save Graph "C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Origi
> nal\Graphs\Democracy_PolityIV_top 10 percent democracy line.gph"
(file C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Graphs\Dem
> ocracy_PolityIV_top 10 percent democracy line.gph saved)

. xtline co2pc if polity2 <=1, overlay

. graph save Graph "C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Origi
> nal\Graphs\Democracy_PolityIV_bottom 10 percent democracy line.gph"
(file C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Graphs\Dem
> ocracy_PolityIV_bottom 10 percent democracy line.gph saved)

. reg co2pc polity2 lngdppc trade if countryname!="Qatar", robust

Linear regression                                      Number of obs =    1544
                                                       F(  3,  1540) =  673.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6390
                                                       Root MSE      =  3.0165

------------------------------------------------------------------------------
             |               Robust
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   -.134507   .0127088   -10.58   0.000    -.1594353   -.1095787
     lngdppc |   3.976429    .089109    44.62   0.000     3.801641    4.151217
       trade |   .0034509   .0023729     1.45   0.146    -.0012036    .0081053
       _cons |  -31.40658   .7687439   -40.85   0.000    -32.91448   -29.89869
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, No)
>  ctitle(Model 1) drop(i.year) replace
output_co2fed.xml
dir : seeout

. xtreg co2pc polity2 lngdppc trade i.year if countryname!="Qatar", fe

Fixed-effects (within) regression               Number of obs      =      1544
Group variable: c_code                          Number of groups   =        66

R-sq:  within  = 0.1682                         Obs per group: min =         1
       between = 0.6273                                        avg =      23.4
       overall = 0.5999                                        max =        26

                                                F(28,1450)         =     10.47
corr(u_i, Xb)  = 0.5732                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0123302   .0089187     1.38   0.167    -.0051646    .0298251
     lngdppc |   1.628826   .1260229    12.92   0.000     1.381619    1.876032
       trade |  -.0029153    .001108    -2.63   0.009    -.0050889   -.0007418
             |
        year |
       1991  |   .1080345   .1573482     0.69   0.492      -.20062     .416689
       1992  |    .374703   .1540363     2.43   0.015     .0725451    .6768609
       1993  |   .3286826   .1534032     2.14   0.032     .0277666    .6295986
       1994  |   .3134275   .1536828     2.04   0.042     .0119632    .6148918
       1995  |   .1998843   .1529267     1.31   0.191    -.1000969    .4998654
       1996  |   .2524228   .1529061     1.65   0.099     -.047518    .5523635
       1997  |   .1834392   .1529132     1.20   0.230    -.1165155    .4833939
       1998  |    .151388   .1531635     0.99   0.323    -.1490578    .4518338
       1999  |   .1528014   .1532089     1.00   0.319    -.1477334    .4533363
       2000  |    .155127   .1527263     1.02   0.310    -.1444611     .454715
       2001  |   .1418474   .1530731     0.93   0.354     -.158421    .4421159
       2002  |   .1148048   .1537218     0.75   0.455    -.1867361    .4163458
       2003  |   .2872138   .1547503     1.86   0.064    -.0163446    .5907723
       2004  |   .3386582   .1562385     2.17   0.030     .0321805    .6451359
       2005  |   .2507821   .1584971     1.58   0.114    -.0601261    .5616903
       2006  |    .267608   .1599025     1.67   0.094     -.046057    .5812729
       2007  |   .1770589   .1619576     1.09   0.274    -.1406373    .4947551
       2008  |   .1889355   .1632232     1.16   0.247    -.1312433    .5091142
       2009  |  -.1013388   .1617306    -0.63   0.531    -.4185898    .2159123
       2010  |   .0479468   .1629192     0.29   0.769    -.2716356    .3675293
       2011  |  -.0433877   .1653237    -0.26   0.793    -.3676869    .2809115
       2012  |  -.0872327   .1659242    -0.53   0.599    -.4127098    .2382444
       2013  |   -.223733   .1666752    -1.34   0.180    -.5506832    .1032173
       2014  |  -.3102095   .1673263    -1.85   0.064    -.6384371    .0180181
       2015  |  -.3798065   .1687064    -2.25   0.025    -.7107412   -.0488718
             |
       _cons |  -10.19064   1.132093    -9.00   0.000    -12.41135   -7.969923
-------------+----------------------------------------------------------------
     sigma_u |  3.8825146
     sigma_e |  .77354845
         rho |  .96181943   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(65, 1450) =   329.61            Prob > F = 0.0000

. xtreg co2pc polity2 lngdppc trade i.year if countryname!="Qatar", vce(cluster c_code)  

Random-effects GLS regression                   Number of obs      =      1544
Group variable: c_code                          Number of groups   =        66

R-sq:  within  = 0.1671                         Obs per group: min =         1
       between = 0.6323                                        avg =      23.4
       overall = 0.6042                                        max =        26

                                                Wald chi2(28)      =    148.12
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                (Std. Err. adjusted for 66 clusters in c_code)
------------------------------------------------------------------------------
             |               Robust
       co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0135786    .020511     0.66   0.508    -.0266222    .0537794
     lngdppc |   1.903776   .4695781     4.05   0.000     .9834199    2.824132
       trade |  -.0024996   .0025355    -0.99   0.324    -.0074691    .0024698
             |
        year |
       1991  |   .1104023   .1065172     1.04   0.300    -.0983677    .3191723
       1992  |   .3735082    .167201     2.23   0.025     .0458003    .7012161
       1993  |   .3194715   .1702523     1.88   0.061     -.014217    .6531599
       1994  |   .3060165   .1464742     2.09   0.037     .0189323    .5931006
       1995  |    .188311   .0988913     1.90   0.057    -.0055125    .3821345
       1996  |   .2337422   .1176633     1.99   0.047     .0031265     .464358
       1997  |    .156654   .1011304     1.55   0.121    -.0415578    .3548659
       1998  |      .1193   .1052614     1.13   0.257    -.0870085    .3256084
       1999  |   .1157968   .1190983     0.97   0.331    -.1176316    .3492252
       2000  |   .1073854   .1653687     0.65   0.516    -.2167312     .431502
       2001  |   .0898245   .1707828     0.53   0.599    -.2449036    .4245527
       2002  |   .0578934   .1839701     0.31   0.753    -.3026815    .4184683
       2003  |   .2243961   .1853663     1.21   0.226    -.1389152    .5877073
       2004  |   .2619569   .2219408     1.18   0.238    -.1730391    .6969528
       2005  |   .1615891   .2343033     0.69   0.490    -.2976369    .6208151
       2006  |    .164618   .2651246     0.62   0.535    -.3550166    .6842526
       2007  |   .0601035   .2492186     0.24   0.809    -.4283559    .5485629
       2008  |   .0645431     .28233     0.23   0.819    -.4888135    .6178997
       2009  |   -.217253   .3134071    -0.69   0.488    -.8315197    .3970136
       2010  |   -.078234    .317024    -0.25   0.805    -.6995896    .5431217
       2011  |  -.1794202   .3149384    -0.57   0.569    -.7966882    .4378478
       2012  |  -.2282275   .3509025    -0.65   0.515    -.9159837    .4595287
       2013  |  -.3704291   .3576193    -1.04   0.300     -1.07135    .3304919
       2014  |  -.4623669   .3889651    -1.19   0.235    -1.224725    .2999907
       2015  |  -.5360974   .4171551    -1.29   0.199    -1.353706    .2815116
             |
       _cons |  -12.52813    3.96758    -3.16   0.002    -20.30445   -4.751819
-------------+----------------------------------------------------------------
     sigma_u |  2.8753785
     sigma_e |  .77354845
         rho |  .93251013   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1: GLS, Random) drop(i.year) append
output_co2fed.xml
dir : seeout

. xtpcse co2pc polity2 lngdppc trade i.year if countryname!="Qatar", corr(ar1) pairwise 

Number of gaps in sample:  1
(note: computations for rho restarted at each gap)
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])
(note: at least one disturbance covariance assumed 0, no common time periods
       between panels)

Prais-Winsten regression, correlated panels corrected standard errors (PCSEs)

Group variable:   c_code                        Number of obs      =      1544
Time variable:    year                          Number of groups   =        66
Panels:           correlated (unbalanced)       Obs per group: min =         1
Autocorrelation:  common AR(1)                                 avg =  23.39394
Sigma computed by pairwise selection                           max =        26
Estimated covariances      =      2211          R-squared          =    0.4009
Estimated autocorrelations =         1          Wald chi2(28)      =    497.54
Estimated coefficients     =        29          Prob > chi2        =    0.0000

------------------------------------------------------------------------------
             |           Panel-corrected
       co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |  -.0112956   .0079347    -1.42   0.155    -.0268473    .0042561
     lngdppc |   3.092025    .195611    15.81   0.000     2.708634    3.475415
       trade |   .0007389    .001129     0.65   0.513    -.0014738    .0029517
             |
        year |
       1991  |   .1497197   .0653345     2.29   0.022     .0216663    .2777731
       1992  |   .1669149   .0824528     2.02   0.043     .0053103    .3285195
       1993  |   .0975705   .0972508     1.00   0.316    -.0930376    .2881785
       1994  |    .104075   .1102177     0.94   0.345    -.1119478    .3200977
       1995  |  -.0650379   .1232193    -0.53   0.598    -.3065433    .1764675
       1996  |  -.0523851   .1362134    -0.38   0.701    -.3193584    .2145881
       1997  |  -.1729134    .149699    -1.16   0.248    -.4663181    .1204914
       1998  |  -.2282149   .1618955    -1.41   0.159    -.5455243    .0890946
       1999  |  -.2591094   .1740646    -1.49   0.137    -.6002698     .082051
       2000  |  -.2781444   .1854023    -1.50   0.134    -.6415262    .0852374
       2001  |  -.3120139   .1944738    -1.60   0.109    -.6931755    .0691477
       2002  |   -.360387   .2034896    -1.77   0.077    -.7592193    .0384452
       2003  |   -.234692   .2144482    -1.09   0.274    -.6550028    .1856188
       2004  |  -.2723221   .2278589    -1.20   0.232    -.7189174    .1742731
       2005  |  -.4140062   .2392566    -1.73   0.084    -.8829406    .0549282
       2006  |  -.4623479   .2510059    -1.84   0.065    -.9543104    .0296146
       2007  |  -.6332638   .2630061    -2.41   0.016    -1.148746   -.1177814
       2008  |  -.6633438   .2721329    -2.44   0.015    -1.196715   -.1299731
       2009  |  -.8918604   .2740755    -3.25   0.001    -1.429038   -.3546824
       2010  |  -.7938429   .2814459    -2.82   0.005    -1.345467   -.2422191
       2011  |  -.9298438   .2901939    -3.20   0.001    -1.498613   -.3610743
       2012  |  -1.006675   .2969728    -3.39   0.001    -1.588731   -.4246189
       2013  |     -1.164   .3029988    -3.84   0.000    -1.757867   -.5701334
       2014  |   -1.27157   .3087058    -4.12   0.000    -1.876622   -.6665179
       2015  |   -1.37242   .3133798    -4.38   0.000    -1.986633   -.7582068
             |
       _cons |  -23.07329    1.67691   -13.76   0.000    -26.35998   -19.78661
-------------+----------------------------------------------------------------
         rho |   .9531542
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) ctitle(Model 1: PCSE
> ) drop(i.year) append
output_co2fed.xml
dir : seeout

. xtscc co2pc polity2 lngdppc trade i.year if countryname!="Qatar", re lag(4) 
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      1544
Method: Random-effects GLS regression            Number of groups  =        66
Group variable (i): c_code                       Wald chi2(28)     =2743523.62
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.6042

------------------------------------------------------------------------------
             |             Drisc/Kraay
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0135786   .0148872     0.91   0.370    -.0170821    .0442393
     lngdppc |   1.903776   .2913533     6.53   0.000     1.303723    2.503829
       trade |  -.0024996   .0018275    -1.37   0.184    -.0062634    .0012641
             |
        year |
       1990  |          0  (empty)
       1991  |   .1104023   .0321774     3.43   0.002     .0441317    .1766729
       1992  |   .3735082   .0583435     6.40   0.000     .2533475    .4936689
       1993  |   .3194715   .0578923     5.52   0.000     .2002401    .4387028
       1994  |   .3060165   .0636807     4.81   0.000     .1748635    .4371694
       1995  |    .188311   .0591311     3.18   0.004     .0665283    .3100937
       1996  |   .2337422   .0517285     4.52   0.000     .1272053    .3402791
       1997  |    .156654   .0533693     2.94   0.007     .0467379    .2665702
       1998  |      .1193   .0535183     2.23   0.035     .0090769     .229523
       1999  |   .1157968   .0528896     2.19   0.038     .0068687    .2247249
       2000  |   .1073854   .0650124     1.65   0.111    -.0265101    .2412809
       2001  |   .0898245   .0663569     1.35   0.188      -.04684    .2264891
       2002  |   .0578934   .0697179     0.83   0.414    -.0856934    .2014802
       2003  |   .2243961   .0728811     3.08   0.005     .0742946    .3744976
       2004  |   .2619569   .0834988     3.14   0.004     .0899879    .4339258
       2005  |   .1615891   .0908194     1.78   0.087     -.025457    .3486352
       2006  |    .164618   .1014921     1.62   0.117    -.0444088    .3736448
       2007  |   .0601035   .1132829     0.53   0.600     -.173207    .2934141
       2008  |   .0645431   .1199764     0.54   0.595    -.1825529    .3116391
       2009  |   -.217253   .1113859    -1.95   0.062    -.4466566    .0121506
       2010  |   -.078234   .1197883    -0.65   0.520    -.3249425    .1684746
       2011  |  -.1794202   .1306273    -1.37   0.182    -.4484521    .0896117
       2012  |  -.2282275   .1349036    -1.69   0.103    -.5060668    .0496117
       2013  |  -.3704291   .1390057    -2.66   0.013    -.6567167   -.0841416
       2014  |  -.4623669   .1429091    -3.24   0.003    -.7566937   -.1680401
       2015  |  -.5360974   .1455259    -3.68   0.001    -.8358136   -.2363812
             |
       _cons |  -12.52813   2.588773    -4.84   0.000    -17.85981   -7.196456
-------------+----------------------------------------------------------------
     sigma_u |  2.8753785
     sigma_e |  .77354845
         rho |  .93251013   (fraction of variance due to u_i)
------------------------------------------------------------------------------


. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1: XTSCC) drop(i.year) append
output_co2fed.xml
dir : seeout

. reg co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude if countryname!="Qatar", robust

Linear regression                                      Number of obs =    1544
                                                       F(  9,  1533) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.7258
                                                       Root MSE      =   2.635

------------------------------------------------------------------------------
             |               Robust
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |  -.1809141   .0136353   -13.27   0.000    -.2076599   -.1541684
     lngdppc |   2.933862   .1624457    18.06   0.000     2.615222    3.252501
       trade |   .0053768   .0023007     2.34   0.020     .0008639    .0098897
         pop |   1.80e-09   2.10e-10     8.57   0.000     1.39e-09    2.21e-09
       urban |   .0037419   .0047161     0.79   0.428    -.0055087    .0129925
       renew |   .0067362   .0035019     1.92   0.055    -.0001329    .0136053
      forest |  -.0119716   .0026732    -4.48   0.000    -.0172151   -.0067281
      annexI |   4.079047   .2435649    16.75   0.000     3.601291    4.556803
      island |   .7608332   .3056787     2.49   0.013     .1612404    1.360426
    latitude |   .1056344   .0640425     1.65   0.099    -.0199857    .2312546
       _cons |  -23.50218   1.327037   -17.71   0.000    -26.10518   -20.89918
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, No)
>  ctitle(Model 2: OLS) drop(i.year) replace
output_co2fed.xml
dir : seeout

. xtreg co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", vce(clus
> ter c_code)

Random-effects GLS regression                   Number of obs      =      1544
Group variable: c_code                          Number of groups   =        66

R-sq:  within  = 0.2037                         Obs per group: min =         1
       between = 0.6944                                        avg =      23.4
       overall = 0.6660                                        max =        26

                                                Wald chi2(35)      =    324.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                (Std. Err. adjusted for 66 clusters in c_code)
------------------------------------------------------------------------------
             |               Robust
       co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0071282   .0199718     0.36   0.721    -.0320158    .0462722
     lngdppc |   1.520217   .4394865     3.46   0.001     .6588397    2.381595
       trade |  -.0031699   .0023862    -1.33   0.184    -.0078468     .001507
         pop |   1.38e-09   1.93e-09     0.72   0.474    -2.40e-09    5.15e-09
       urban |   .0325799    .023074     1.41   0.158    -.0126444    .0778042
       renew |  -.0195053   .0087719    -2.22   0.026    -.0366979   -.0023126
      forest |  -.0204926   .0129143    -1.59   0.113    -.0458041    .0048189
      annexI |    4.78023   1.272492     3.76   0.000     2.286192    7.274268
      island |  -.3311295   1.395435    -0.24   0.812    -3.066133    2.403874
    latitude |  -.1395684   .3327016    -0.42   0.675    -.7916515    .5125147
             |
        year |
       1991  |   .1051545   .1043962     1.01   0.314    -.0994584    .3097673
       1992  |   .3414119   .1573138     2.17   0.030     .0330826    .6497412
       1993  |    .272236   .1617276     1.68   0.092    -.0447443    .5892162
       1994  |   .2334396   .1419141     1.64   0.100     -.044707    .5115861
       1995  |   .0971302    .091445     1.06   0.288    -.0820987    .2763592
       1996  |   .1362296   .1178781     1.16   0.248    -.0948073    .3672665
       1997  |   .0404543   .1126763     0.36   0.720    -.1803872    .2612958
       1998  |  -.0100128   .1198576    -0.08   0.933    -.2449294    .2249039
       1999  |  -.0217741   .1334576    -0.16   0.870    -.2833462     .239798
       2000  |   -.031569   .1803745    -0.18   0.861    -.3850965    .3219586
       2001  |   -.064486   .1870702    -0.34   0.730    -.4311368    .3021648
       2002  |  -.0973079    .203528    -0.48   0.633    -.4962154    .3015997
       2003  |   .0572694   .2068988     0.28   0.782    -.3482448    .4627835
       2004  |   .0924245     .24099     0.38   0.701    -.3799071    .5647561
       2005  |  -.0067587   .2508386    -0.03   0.979    -.4983933    .4848759
       2006  |   .0011445   .2787104     0.00   0.997    -.5451179    .5474069
       2007  |  -.1068946   .2682399    -0.40   0.690    -.6326351    .4188459
       2008  |  -.1008188   .2971296    -0.34   0.734    -.6831822    .4815446
       2009  |  -.4083947   .3301562    -1.24   0.216    -1.055489    .2386997
       2010  |  -.2715813   .3331923    -0.82   0.415    -.9246263    .3814637
       2011  |  -.3753032   .3276721    -1.15   0.252    -1.017529    .2669223
       2012  |  -.4317097   .3587778    -1.20   0.229    -1.134901    .2714819
       2013  |  -.5756005   .3612676    -1.59   0.111    -1.283672     .132471
       2014  |    -.67482   .3917902    -1.72   0.085    -1.442715    .0930747
       2015  |  -.7678099   .4232682    -1.81   0.070      -1.5974    .0617805
             |
       _cons |  -10.49871   3.437504    -3.05   0.002    -17.23609   -3.761321
-------------+----------------------------------------------------------------
     sigma_u |   2.705749
     sigma_e |  .75773849
         rho |  .92727678   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: GLS, Random) drop(i.year) append
output_co2fed.xml
dir : seeout

. xtreg co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", fe
note: annexI omitted because of collinearity
note: island omitted because of collinearity
note: latitude omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =      1544
Group variable: c_code                          Number of groups   =        66

R-sq:  within  = 0.2040                         Obs per group: min =         1
       between = 0.5686                                        avg =      23.4
       overall = 0.5486                                        max =        26

                                                F(32,1446)         =     11.58
corr(u_i, Xb)  = 0.2843                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0098136   .0087749     1.12   0.264    -.0073994    .0270266
     lngdppc |   1.501907   .1332562    11.27   0.000     1.240511    1.763303
       trade |  -.0035557   .0010965    -3.24   0.001    -.0057065   -.0014048
         pop |   1.47e-09   1.05e-09     1.40   0.163    -5.95e-10    3.53e-09
       urban |   .0362806   .0095195     3.81   0.000     .0176071    .0549541
       renew |  -.0188024   .0043136    -4.36   0.000     -.027264   -.0103408
      forest |  -.0273907   .0135322    -2.02   0.043    -.0539355   -.0008458
      annexI |          0  (omitted)
      island |          0  (omitted)
    latitude |          0  (omitted)
             |
        year |
       1991  |   .1020669   .1542085     0.66   0.508    -.2004294    .4045631
       1992  |   .3315443   .1512567     2.19   0.029     .0348382    .6282503
       1993  |   .2635559   .1509964     1.75   0.081    -.0326395    .5597512
       1994  |   .2229903    .151534     1.47   0.141    -.0742597    .5202403
       1995  |   .0862663   .1512307     0.57   0.568    -.2103887    .3829212
       1996  |   .1247438   .1516588     0.82   0.411    -.1727509    .4222386
       1997  |   .0288543   .1519528     0.19   0.849    -.2692173    .3269258
       1998  |  -.0221678   .1525934    -0.15   0.885    -.3214959    .2771603
       1999  |  -.0342408   .1531763    -0.22   0.823    -.3347124    .2662309
       2000  |  -.0454376   .1532541    -0.30   0.767    -.3460618    .2551866
       2001  |   -.080193   .1542685    -0.52   0.603     -.382807     .222421
       2002  |  -.1152993   .1557135    -0.74   0.459    -.4207478    .1901491
       2003  |   .0383962   .1574947     0.24   0.807    -.2705463    .3473387
       2004  |   .0758326   .1594602     0.48   0.634    -.2369655    .3886307
       2005  |  -.0248349   .1626795    -0.15   0.879     -.343948    .2942782
       2006  |   -.017951   .1650629    -0.11   0.913    -.3417393    .3058373
       2007  |  -.1252079   .1678362    -0.75   0.456    -.4544364    .2040205
       2008  |  -.1198954   .1701447    -0.70   0.481    -.4536522    .2138614
       2009  |   -.433717   .1704312    -2.54   0.011    -.7680358   -.0993982
       2010  |  -.2965114   .1723619    -1.72   0.086    -.6346175    .0415948
       2011  |  -.3994369   .1754599    -2.28   0.023    -.7436201   -.0552537
       2012  |  -.4559201   .1771243    -2.57   0.010    -.8033682   -.1084721
       2013  |  -.6011544   .1792038    -3.35   0.001    -.9526817   -.2496272
       2014  |  -.7015572   .1810057    -3.88   0.000    -1.056619   -.3464953
       2015  |  -.7970225   .1836494    -4.34   0.000     -1.15727   -.4367747
             |
       _cons |  -9.517194   1.261661    -7.54   0.000    -11.99208   -7.042312
-------------+----------------------------------------------------------------
     sigma_u |  3.5424266
     sigma_e |  .75773849
         rho |  .95624708   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(65, 1446) =   331.28            Prob > F = 0.0000

. xtreg co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", vce(clus
> ter c_code)

Random-effects GLS regression                   Number of obs      =      1544
Group variable: c_code                          Number of groups   =        66

R-sq:  within  = 0.2037                         Obs per group: min =         1
       between = 0.6944                                        avg =      23.4
       overall = 0.6660                                        max =        26

                                                Wald chi2(35)      =    324.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                (Std. Err. adjusted for 66 clusters in c_code)
------------------------------------------------------------------------------
             |               Robust
       co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0071282   .0199718     0.36   0.721    -.0320158    .0462722
     lngdppc |   1.520217   .4394865     3.46   0.001     .6588397    2.381595
       trade |  -.0031699   .0023862    -1.33   0.184    -.0078468     .001507
         pop |   1.38e-09   1.93e-09     0.72   0.474    -2.40e-09    5.15e-09
       urban |   .0325799    .023074     1.41   0.158    -.0126444    .0778042
       renew |  -.0195053   .0087719    -2.22   0.026    -.0366979   -.0023126
      forest |  -.0204926   .0129143    -1.59   0.113    -.0458041    .0048189
      annexI |    4.78023   1.272492     3.76   0.000     2.286192    7.274268
      island |  -.3311295   1.395435    -0.24   0.812    -3.066133    2.403874
    latitude |  -.1395684   .3327016    -0.42   0.675    -.7916515    .5125147
             |
        year |
       1991  |   .1051545   .1043962     1.01   0.314    -.0994584    .3097673
       1992  |   .3414119   .1573138     2.17   0.030     .0330826    .6497412
       1993  |    .272236   .1617276     1.68   0.092    -.0447443    .5892162
       1994  |   .2334396   .1419141     1.64   0.100     -.044707    .5115861
       1995  |   .0971302    .091445     1.06   0.288    -.0820987    .2763592
       1996  |   .1362296   .1178781     1.16   0.248    -.0948073    .3672665
       1997  |   .0404543   .1126763     0.36   0.720    -.1803872    .2612958
       1998  |  -.0100128   .1198576    -0.08   0.933    -.2449294    .2249039
       1999  |  -.0217741   .1334576    -0.16   0.870    -.2833462     .239798
       2000  |   -.031569   .1803745    -0.18   0.861    -.3850965    .3219586
       2001  |   -.064486   .1870702    -0.34   0.730    -.4311368    .3021648
       2002  |  -.0973079    .203528    -0.48   0.633    -.4962154    .3015997
       2003  |   .0572694   .2068988     0.28   0.782    -.3482448    .4627835
       2004  |   .0924245     .24099     0.38   0.701    -.3799071    .5647561
       2005  |  -.0067587   .2508386    -0.03   0.979    -.4983933    .4848759
       2006  |   .0011445   .2787104     0.00   0.997    -.5451179    .5474069
       2007  |  -.1068946   .2682399    -0.40   0.690    -.6326351    .4188459
       2008  |  -.1008188   .2971296    -0.34   0.734    -.6831822    .4815446
       2009  |  -.4083947   .3301562    -1.24   0.216    -1.055489    .2386997
       2010  |  -.2715813   .3331923    -0.82   0.415    -.9246263    .3814637
       2011  |  -.3753032   .3276721    -1.15   0.252    -1.017529    .2669223
       2012  |  -.4317097   .3587778    -1.20   0.229    -1.134901    .2714819
       2013  |  -.5756005   .3612676    -1.59   0.111    -1.283672     .132471
       2014  |    -.67482   .3917902    -1.72   0.085    -1.442715    .0930747
       2015  |  -.7678099   .4232682    -1.81   0.070      -1.5974    .0617805
             |
       _cons |  -10.49871   3.437504    -3.05   0.002    -17.23609   -3.761321
-------------+----------------------------------------------------------------
     sigma_u |   2.705749
     sigma_e |  .75773849
         rho |  .92727678   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: GLS, Random) drop(i.year) append
output_co2fed.xml
dir : seeout

. xtpcse co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", corr(ar
> 1) pairwise  

Number of gaps in sample:  1
(note: computations for rho restarted at each gap)
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])
(note: at least one disturbance covariance assumed 0, no common time periods
       between panels)

Prais-Winsten regression, correlated panels corrected standard errors (PCSEs)

Group variable:   c_code                        Number of obs      =      1544
Time variable:    year                          Number of groups   =        66
Panels:           correlated (unbalanced)       Obs per group: min =         1
Autocorrelation:  common AR(1)                                 avg =  23.39394
Sigma computed by pairwise selection                           max =        26
Estimated covariances      =      2211          R-squared          =    0.5156
Estimated autocorrelations =         1          Wald chi2(34)      =   1295.85
Estimated coefficients     =        36          Prob > chi2        =    0.0000

------------------------------------------------------------------------------
             |           Panel-corrected
       co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |  -.0233772   .0082834    -2.82   0.005    -.0396124    -.007142
     lngdppc |   1.990863   .2169505     9.18   0.000     1.565648    2.416078
       trade |   .0008414   .0010687     0.79   0.431    -.0012532     .002936
         pop |   1.66e-09   2.66e-10     6.23   0.000     1.13e-09    2.18e-09
       urban |   .0068276   .0058943     1.16   0.247     -.004725    .0183802
       renew |  -.0233423   .0042749    -5.46   0.000    -.0317209   -.0149637
      forest |  -.0096801   .0053796    -1.80   0.072    -.0202239    .0008637
      annexI |   4.198009   .4951636     8.48   0.000     3.227506    5.168512
      island |  -.3465335   .3755808    -0.92   0.356    -1.082658    .3895913
    latitude |  -.0522037   .1153067    -0.45   0.651    -.2782006    .1737932
             |
        year |
       1991  |   .1245657   .0525927     2.37   0.018     .0214859    .2276454
       1992  |   .1583593   .0660553     2.40   0.017     .0288934    .2878253
       1993  |   .0953458   .0757223     1.26   0.208    -.0530671    .2437587
       1994  |   .0759904   .0861755     0.88   0.378    -.0929104    .2448913
       1995  |  -.0872854   .0943984    -0.92   0.355    -.2723028     .097732
       1996  |  -.0524205   .1022547    -0.51   0.608    -.2528362    .1479951
       1997  |  -.1654465   .1112989    -1.49   0.137    -.3835884    .0526954
       1998  |  -.2118184   .1193574    -1.77   0.076    -.4457545    .0221178
       1999  |  -.2295074   .1272025    -1.80   0.071    -.4788197    .0198048
       2000  |  -.2218764   .1326673    -1.67   0.094    -.4818995    .0381468
       2001  |  -.2480004   .1377448    -1.80   0.072    -.5179752    .0219744
       2002  |    -.27152   .1422614    -1.91   0.056    -.5503473    .0073073
       2003  |  -.1312935   .1484088    -0.88   0.376    -.4221693    .1595823
       2004  |  -.1384568   .1560522    -0.89   0.375    -.4443135    .1673998
       2005  |  -.2407176   .1621836    -1.48   0.138    -.5585917    .0771565
       2006  |  -.2391067    .168385    -1.42   0.156    -.5691352    .0909219
       2007  |  -.3757083   .1758497    -2.14   0.033    -.7203674   -.0310492
       2008  |  -.3782312   .1812599    -2.09   0.037    -.7334941   -.0229684
       2009  |   -.625859   .1814822    -3.45   0.001    -.9815575   -.2701605
       2010  |  -.5069208   .1862685    -2.72   0.006    -.8720004   -.1418412
       2011  |  -.6207375   .1920229    -3.23   0.001    -.9970954   -.2443796
       2012  |  -.6884394   .1963421    -3.51   0.000    -1.073263   -.3036158
       2013  |  -.8264831   .1994378    -4.14   0.000    -1.217374   -.4355922
       2014  |  -.9224883   .2029132    -4.55   0.000    -1.320191   -.5247858
       2015  |  -1.017764   .2047158    -4.97   0.000    -1.418999   -.6165283
             |
       _cons |  -13.62607   1.796739    -7.58   0.000    -17.14761   -10.10452
-------------+----------------------------------------------------------------
         rho |   .9367147
------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: PCSE) drop(i.year) append
output_co2fed.xml
dir : seeout

. xtscc co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", re lag(4
> )
no room to add more variables
    Up to 2,048 variables are allowed with this version of Stata.  Versions are available that allow up to 32,767
    variables.
r(900);

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: XTSCC) drop(i.year) append
matrix e(b) not found; run/post a regression, or specify varlist for non-regression outputs
r(111);

. drop v2x_freexp_altinf_sd v2x_frassoc_thick v2x_frassoc_thick_codelow v2x_frassoc_thick_codehigh v2x_frassoc_thick_sd v2
> x_suffr v2xel_frefair v2xel_frefair_codelow v2xel_frefair_codehigh v2xel_frefair_sd v2x_elecoff v2x_liberal v2x_liberal_
> codelow v2x_liberal_codehigh v2x_liberal_sd v2xcl_rol v2xcl_rol_codelow 

. xtscc co2pc polity2 lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", re lag(4
> )
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      1544
Method: Random-effects GLS regression            Number of groups  =        66
Group variable (i): c_code                       Wald chi2(32)     =1097523.13
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.6660

------------------------------------------------------------------------------
             |             Drisc/Kraay
       co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     polity2 |   .0071282   .0106992     0.67   0.511    -.0149072    .0291637
     lngdppc |   1.520217   .3327293     4.57   0.000     .8349487    2.205486
       trade |  -.0031699    .002097    -1.51   0.143    -.0074887    .0011489
         pop |   1.38e-09   8.45e-10     1.63   0.115    -3.60e-10    3.12e-09
       urban |   .0325799   .0081805     3.98   0.001     .0157318     .049428
       renew |  -.0195053   .0031572    -6.18   0.000    -.0260077   -.0130028
      forest |  -.0204926   .0190531    -1.08   0.292    -.0597332     .018748
      annexI |    4.78023   3.361106     1.42   0.167    -2.142098    11.70256
      island |  -.3311295   2.126273    -0.16   0.877    -4.710271    4.048012
    latitude |  -.1395684   .5526892    -0.25   0.803    -1.277853    .9987163
             |
        year |
       1990  |          0  (empty)
       1991  |   .1051545    .021081     4.99   0.000     .0617374    .1485715
       1992  |   .3414119   .0421078     8.11   0.000     .2546893    .4281345
       1993  |    .272236   .0445115     6.12   0.000     .1805629     .363909
       1994  |   .2334396   .0496097     4.71   0.000     .1312665    .3356126
       1995  |   .0971302   .0503744     1.93   0.065    -.0066178    .2008783
       1996  |   .1362296   .0502401     2.71   0.012     .0327581     .239701
       1997  |   .0404543   .0499856     0.81   0.426     -.062493    .1434017
       1998  |  -.0100128   .0561992    -0.18   0.860    -.1257572    .1057316
       1999  |  -.0217741   .0608909    -0.36   0.724    -.1471812     .103633
       2000  |   -.031569   .0669458    -0.47   0.641    -.1694464    .1063084
       2001  |   -.064486   .0769716    -0.84   0.410    -.2230119      .09404
       2002  |  -.0973079   .0848825    -1.15   0.262    -.2721266    .0775109
       2003  |   .0572694   .0904574     0.63   0.532    -.1290311    .2435698
       2004  |   .0924245   .0969081     0.95   0.349    -.1071614    .2920104
       2005  |  -.0067587   .1130075    -0.06   0.953    -.2395021    .2259847
       2006  |   .0011445   .1284286     0.01   0.993    -.2633591     .265648
       2007  |  -.1068946   .1425712    -0.75   0.460    -.4005255    .1867363
       2008  |  -.1008188   .1502005    -0.67   0.508    -.4101624    .2085249
       2009  |  -.4083947   .1616507    -2.53   0.018    -.7413204   -.0754689
       2010  |  -.2715813   .1736174    -1.56   0.130    -.6291531    .0859905
       2011  |  -.3753032   .1803987    -2.08   0.048    -.7468412   -.0037652
       2012  |  -.4317097   .1871275    -2.31   0.030     -.817106   -.0463134
       2013  |  -.5756005   .1970703    -2.92   0.007    -.9814744   -.1697267
       2014  |    -.67482   .2068234    -3.26   0.003    -1.100781   -.2488592
       2015  |  -.7678099   .2199178    -3.49   0.002    -1.220739   -.3148807
             |
       _cons |  -10.49871   3.236671    -3.24   0.003    -17.16476   -3.832657
-------------+----------------------------------------------------------------
     sigma_u |   2.705749
     sigma_e |  .75773849
         rho |  .92727678   (fraction of variance due to u_i)
------------------------------------------------------------------------------


. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: XTSCC) drop(i.year) append
output_co2fed.xml
dir : seeout

. log close
      name:  <unnamed>
       log:  C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Log
>  file_Empirical Analysis_Final Version\Log file_Democracy_PolityIV_TSCS_Oct11,2020.log
  log type:  text
 closed on:  11 Oct 2020, 09:37:14
--------------------------------------------------------------------------------------------------------------------------
