--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Log
>  file_Empirical Analysis_Final Version\Log file_Democracy_Freedom House_TSCS_Oct11,2020.log
  log type:  text
 opened on:  11 Oct 2020, 12:09:26

. 
. clear all

. 
. set more off 

. 
. pause on

. 
. use "C:\Users\Muinul\Desktop\muinul.democracy.dta", clear

. 
. global id c_code

. 
. global t year

. 
. sort $id $t

. 
. xtset $id $t, yearly
       panel variable:  c_code (unbalanced)
        time variable:  year, 1789 to 2020, but with gaps
                delta:  1 year

. 
. xtdescribe

  c_code:  1, 2, ..., 397                                    n =        397
    year:  1789, 1790, ..., 2020                             T =        232
           Delta(year) = 1 year
           Span(year)  = 232 periods
           (c_code*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         5      46      61        76       121     232     232

     Freq.  Percent    Cum. |  Pattern*
 ---------------------------+---------------------------------------------------------------------------------------------
> --------------------------
       71     17.88   17.88 |  .....................................................................................122222
> 2222222222222222222222222
       50     12.59   30.48 |  .......................................................122222222222222222222222222222222222
> 2222222222222222222222222
       37      9.32   39.80 |  2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222
> 2222222222222222222222222
       20      5.04   44.84 |  ...........................................................................................
> 122222222222222222222221.
       17      4.28   49.12 |  ...........................................................................................
> 122222222222222222222222.
       12      3.02   52.14 |  .....................................................................................122222
> 222222222222222222222222.
        9      2.27   54.41 |  .....12222222222222222222222222222222222222222222222222222222222222222222222222222222222222
> 222222222222222222222222.
        4      1.01   55.42 |  ........................1222222222222222222222222222222222222222222222222222222222222222222
> 2222222222222222222222222
        4      1.01   56.42 |  222222222222222222222222222222222222222221.................................................
> .........................
      173     43.58  100.00 | (other patterns)
 ---------------------------+---------------------------------------------------------------------------------------------
> --------------------------
      397    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
> XXXXXXXXXXXXXXXXXXXXXXXXX
 -------------------------------------------------------------------------------------------------------------------------
> --------------------------
 *Each column represents 2 periods.


. 
. recode pr (7=1) (6=2) (5=3) (3=5) (2=6) (1=7), gen (pr_recode)
(7486 differences between pr and pr_recode)

. 
. recode cl (7=1) (6=2) (5=3) (3=5) (2=6) (1=7), gen (cl_recode)
(7119 differences between cl and cl_recode)

. 
. gen fh_democracy_sum= (pr_recode+cl_recode)
(33906 missing values generated)

. 
. gen fh_democracy_mean= (pr_recode+cl_recode)/2
(33906 missing values generated)

. 
. * ln CO2 per capita

. 
. gen lnco2pc = log(co2pc)
(30936 missing values generated)

. 
. * ln GDP per capita

. 
. gen lngdppc = log(gdppc)
(36137 missing values generated)

. 
. * GDP per capita squared

. 
. gen lngdppc2 = lngdppc*lngdppc
(36137 missing values generated)

. 
. * ln Population, Total

. 
. gen lnpop = log(pop)
(28445 missing values generated)

. 
. drop if missing(co2pc)
(30935 observations deleted)

. 
. drop if missing(lngdppc)
(5929 observations deleted)

. 
. drop if missing(trade)
(329 observations deleted)

. 
. drop if missing(pop)
(0 observations deleted)

. 
. drop if missing(urban)
(9 observations deleted)

. 
. drop if missing(renew)
(201 observations deleted)

. 
. drop if missing(forest)
(100 observations deleted)

. 
. drop if missing(annexI)
(416 observations deleted)

. 
. drop if missing(island)
(0 observations deleted)

. 
. drop if missing(latitude)
(22 observations deleted)

. 
. drop if missing(fedfof)
(0 observations deleted)

. 
. drop if missing(fh_democracy_sum)
(2397 observations deleted)

. 
. xtreg co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude, re vce (cluster c_code)

Random-effects GLS regression                   Number of obs      =      1754
Group variable: c_code                          Number of groups   =        76

R-sq:  within  = 0.0574                         Obs per group: min =         1
       between = 0.3900                                        avg =      23.1
       overall = 0.4039                                        max =        26

                                                Wald chi2(10)      =    135.13
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                    (Std. Err. adjusted for 76 clusters in c_code)
----------------------------------------------------------------------------------
                 |               Robust
           co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0210876   .0483456     0.44   0.663     -.073668    .1158432
         lngdppc |   1.168758   .3683899     3.17   0.002     .4467271    1.890789
           trade |   -.004786   .0025607    -1.87   0.062    -.0098049    .0002329
             pop |   4.31e-10   2.16e-09     0.20   0.842    -3.81e-09    4.67e-09
           urban |   .0005044   .0210313     0.02   0.981    -.0407161     .041725
           renew |  -.0243113   .0104802    -2.32   0.020    -.0448521   -.0037705
          forest |  -.0158341    .016791    -0.94   0.346    -.0487437    .0170756
          annexI |   4.191372   1.715491     2.44   0.015     .8290721    7.553671
          island |  -1.681321   1.022711    -1.64   0.100    -3.685799     .323156
        latitude |   .6103692   .4163619     1.47   0.143    -.2056852    1.426424
           _cons |  -6.857255   3.095285    -2.22   0.027     -12.9239   -.7906066
-----------------+----------------------------------------------------------------
         sigma_u |  4.9147374
         sigma_e |   1.324294
             rho |  .93230942   (fraction of variance due to u_i)
----------------------------------------------------------------------------------

. 
. predict e, e

. 
. predict u, u

. 
. predict ue, ue  

. 
. kdensity e, norm

. 
. kdensity u, norm

. 
. kdensity ue, norm

. 
. pnorm e

. 
. pnorm u

. 
. pnorm ue

. 
. qnorm e

. 
. qnorm u

. 
. qnorm ue, mlabel(countryname)

. 
. predict e1 if countryname!="Qatar", e
(16 missing values generated)

. 
. predict u1 if countryname!="Qatar", u
(16 missing values generated)

. 
. predict ue1 if countryname!="Qatar", ue
(16 missing values generated)

. 
. kdensity e1 if countryname!="Qatar", norm

. 
. kdensity u1 if countryname!="Qatar", norm

. 
. kdensity ue1 if countryname!="Qatar", norm

. 
. pnorm e1 if countryname!="Qatar"

. 
. pnorm u1 if countryname!="Qatar"

. 
. pnorm ue1 if countryname!="Qatar"

. 
. qnorm e1 if countryname!="Qatar"

. 
. qnorm u1 if countryname!="Qatar"

. 
. qnorm ue1 if countryname!="Qatar", mlabel(countryname)

. 
. reg co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude

      Source |       SS       df       MS              Number of obs =    1754
-------------+------------------------------           F( 10,  1743) =  210.85
       Model |  42254.2145    10  4225.42145           Prob > F      =  0.0000
    Residual |  34929.8793  1743  20.0400914           R-squared     =  0.5474
-------------+------------------------------           Adj R-squared =  0.5449
       Total |  77184.0938  1753  44.0297169           Root MSE      =  4.4766

----------------------------------------------------------------------------------
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |  -.4065762   .0349936   -11.62   0.000      -.47521   -.3379424
         lngdppc |   5.127843   .2175711    23.57   0.000     4.701115    5.554571
           trade |   .0040771    .002274     1.79   0.073    -.0003831    .0085372
             pop |   1.10e-09   5.53e-10     2.00   0.046     1.89e-11    2.19e-09
           urban |  -.0226342   .0087869    -2.58   0.010    -.0398683   -.0054002
           renew |   .0073862   .0059692     1.24   0.216    -.0043213    .0190937
          forest |  -.0239631   .0049025    -4.89   0.000    -.0335785   -.0143476
          annexI |   1.569607   .3512699     4.47   0.000     .8806521    2.258562
          island |   .2926838   .3571593     0.82   0.413     -.407822    .9931895
        latitude |  -.2663188   .1461779    -1.82   0.069    -.5530214    .0203838
           _cons |  -36.25521   1.706304   -21.25   0.000    -39.60182   -32.90859
----------------------------------------------------------------------------------

. 
. lvr2plot, mlabel(countryname)

. 
. sum fh_democracy_sum

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
fh_democra~m |      1754    9.646522    3.831658          2         14

. 
. xtline co2pc if fh_democracy_sum>=12, overlay

. 
. graph save Graph "C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Origi
> nal\Graphs\Democracy_Freedom House_top 10 percent democracy line.gph"
file C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental
    Materials_Original\Graphs\Democracy_Freedom House_top 10 percent democracy line.gph already exists
r(602);

. 
. xtline co2pc if fh_democracy_sum<=4, overlay

. 
. graph save Graph "C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Origi
> nal\Graphs\Democracy_Freedom House_bottom 10 percent democracy line.gph"
file C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental
    Materials_Original\Graphs\Democracy_Freedom House_bottom 10 percent democracy line.gph already exists
r(602);

. 
. reg co2pc fh_democracy_sum lngdppc trade if countryname!="Qatar", robust

Linear regression                                      Number of obs =    1738
                                                       F(  3,  1734) =  657.76
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6198
                                                       Root MSE      =  3.0225

----------------------------------------------------------------------------------
                 |               Robust
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |  -.1776938   .0220584    -8.06   0.000    -.2209577   -.1344299
         lngdppc |   3.910307   .0883071    44.28   0.000     3.737107    4.083507
           trade |   .0016908   .0021528     0.79   0.432    -.0025316    .0059132
           _cons |  -29.60069   .7435097   -39.81   0.000    -31.05896   -28.14242
----------------------------------------------------------------------------------

. 
. outreg2 using output_co2FH1, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, No)
>  ctitle(Model 1: OLS) drop(i.year) replace
output_co2FH1.xml
dir : seeout

. 
. xtreg co2pc fh_democracy_sum lngdppc trade i.year if countryname!="Qatar", fe

Fixed-effects (within) regression               Number of obs      =      1738
Group variable: c_code                          Number of groups   =        75

R-sq:  within  = 0.1421                         Obs per group: min =         1
       between = 0.5913                                        avg =      23.2
       overall = 0.5686                                        max =        26

                                                F(28,1635)         =      9.68
corr(u_i, Xb)  = 0.4800                         Prob > F           =    0.0000

----------------------------------------------------------------------------------
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0764826   .0203295     3.76   0.000     .0366079    .1163572
         lngdppc |   1.824604   .1384952    13.17   0.000     1.552957    2.096251
           trade |  -.0045995    .001172    -3.92   0.000    -.0068983   -.0023007
                 |
            year |
           1991  |   .0514754   .1695252     0.30   0.761    -.2810341    .3839849
           1992  |   .0669168   .1666122     0.40   0.688    -.2598791    .3937128
           1993  |   .0816177   .1657058     0.49   0.622    -.2434003    .4066357
           1994  |     .05757   .1657195     0.35   0.728    -.2674748    .3826148
           1995  |  -.0657284   .1647235    -0.40   0.690    -.3888198     .257363
           1996  |  -.0528248   .1648818    -0.32   0.749    -.3762265    .2705769
           1997  |  -.0884513   .1646499    -0.54   0.591    -.4113983    .2344957
           1998  |   -.149537   .1648614    -0.91   0.365    -.4728988    .1738248
           1999  |  -.1453546   .1650799    -0.88   0.379     -.469145    .1784358
           2000  |  -.1552915    .164375    -0.94   0.345    -.4776993    .1671163
           2001  |  -.1479492   .1645066    -0.90   0.369    -.4706152    .1747167
           2002  |  -.2013661   .1645941    -1.22   0.221    -.5242035    .1214713
           2003  |  -.0447834   .1652283    -0.27   0.786    -.3688649    .2792981
           2004  |  -.0126441   .1669893    -0.08   0.940    -.3401796    .3148915
           2005  |  -.1037013   .1691358    -0.61   0.540    -.4354469    .2280443
           2006  |  -.1618775   .1697654    -0.95   0.340    -.4948581    .1711032
           2007  |  -.2365837   .1716588    -1.38   0.168     -.573278    .1001105
           2008  |    -.22509   .1729233    -1.30   0.193    -.5642646    .1140845
           2009  |  -.4692026   .1708089    -2.75   0.006    -.8042298   -.1341753
           2010  |   -.344506   .1723721    -2.00   0.046    -.6825995   -.0064126
           2011  |  -.3834098    .174188    -2.20   0.028     -.725065   -.0417546
           2012  |  -.3540618   .1749486    -2.02   0.043    -.6972087   -.0109149
           2013  |  -.4596355    .175596    -2.62   0.009    -.8040523   -.1152188
           2014  |  -.6142745   .1764537    -3.48   0.001    -.9603735   -.2681755
           2015  |  -.7362859   .1778522    -4.14   0.000    -1.085128   -.3874437
                 |
           _cons |  -12.38143   1.245708    -9.94   0.000    -14.82479   -9.938082
-----------------+----------------------------------------------------------------
         sigma_u |  3.6315643
         sigma_e |  .88379484
             rho |  .94408522   (fraction of variance due to u_i)
----------------------------------------------------------------------------------
F test that all u_i=0:     F(74, 1635) =   246.71            Prob > F = 0.0000

. 
. xtreg co2pc fh_democracy_sum lngdppc trade i.year if countryname!="Qatar", vce(cluster c_code)  

Random-effects GLS regression                   Number of obs      =      1738
Group variable: c_code                          Number of groups   =        75

R-sq:  within  = 0.1413                         Obs per group: min =         1
       between = 0.6018                                        avg =      23.2
       overall = 0.5776                                        max =        26

                                                Wald chi2(28)      =    104.03
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                    (Std. Err. adjusted for 75 clusters in c_code)
----------------------------------------------------------------------------------
                 |               Robust
           co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0746832   .0397238     1.88   0.060    -.0031739    .1525403
         lngdppc |   2.120245   .4769801     4.45   0.000     1.185381    3.055109
           trade |  -.0041337    .002222    -1.86   0.063    -.0084887    .0002213
                 |
            year |
           1991  |   .0550962   .1025276     0.54   0.591    -.1458542    .2560465
           1992  |   .0703868   .2554988     0.28   0.783    -.4303816    .5711552
           1993  |   .0747488   .2634237     0.28   0.777    -.4415522    .5910498
           1994  |   .0526473   .2697315     0.20   0.845    -.4760168    .5813114
           1995  |  -.0773457   .2612654    -0.30   0.767    -.5894165    .4347251
           1996  |  -.0711994   .2778606    -0.26   0.798    -.6157962    .4733973
           1997  |  -.1144577   .2816863    -0.41   0.684    -.6665526    .4376372
           1998  |  -.1811716   .2885152    -0.63   0.530     -.746651    .3843079
           1999  |  -.1826664   .2898046    -0.63   0.528    -.7506729    .3853402
           2000  |  -.2036823   .3129145    -0.65   0.515    -.8169834    .4096188
           2001  |  -.2004038   .3166975    -0.63   0.527    -.8211194    .4203119
           2002  |  -.2589394   .3301645    -0.78   0.433    -.9060499    .3881711
           2003  |  -.1076461   .3366882    -0.32   0.749    -.7675429    .5522507
           2004  |  -.0899564    .361351    -0.25   0.803    -.7981914    .6182786
           2005  |  -.1931588   .3737027    -0.52   0.605    -.9256026    .5392851
           2006  |  -.2636227   .3969374    -0.66   0.507    -1.041606    .5143603
           2007  |  -.3522998   .3901794    -0.90   0.367    -1.117037    .4124378
           2008  |  -.3490761   .4060857    -0.86   0.390    -1.144989    .4468374
           2009  |  -.5841646   .4273299    -1.37   0.172    -1.421716    .2533867
           2010  |  -.4696101   .4277864    -1.10   0.272    -1.308056    .3688358
           2011  |  -.5184422   .4174535    -1.24   0.214    -1.336636    .2997516
           2012  |  -.4950613   .4348803    -1.14   0.255    -1.347411    .3572883
           2013  |  -.6055823   .4519366    -1.34   0.180    -1.491362    .2801972
           2014  |  -.7651941   .4674493    -1.64   0.102    -1.681378    .1509897
           2015  |  -.8924425   .4921627    -1.81   0.070    -1.857064    .0721787
                 |
           _cons |  -14.86235   3.956886    -3.76   0.000     -22.6177   -7.106996
-----------------+----------------------------------------------------------------
         sigma_u |    2.86478
         sigma_e |  .88379484
             rho |  .91309654   (fraction of variance due to u_i)
----------------------------------------------------------------------------------

. 
. outreg2 using output_co2FH1, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1: GLS, Random) drop(i.year) append
output_co2FH1.xml
dir : seeout

. 
. xtpcse co2pc fh_democracy_sum lngdppc trade i.year if countryname!="Qatar", corr(ar1) pairwise 
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])
(note: at least one disturbance covariance assumed 0, no common time periods
       between panels)

Prais-Winsten regression, correlated panels corrected standard errors (PCSEs)

Group variable:   c_code                        Number of obs      =      1738
Time variable:    year                          Number of groups   =        75
Panels:           correlated (unbalanced)       Obs per group: min =         1
Autocorrelation:  common AR(1)                                 avg =  23.17333
Sigma computed by pairwise selection                           max =        26
Estimated covariances      =      2850          R-squared          =    0.3285
Estimated autocorrelations =         1          Wald chi2(28)      =   1649.80
Estimated coefficients     =        29          Prob > chi2        =    0.0000

----------------------------------------------------------------------------------
                 |           Panel-corrected
           co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |  -.0102794   .0190933    -0.54   0.590    -.0477016    .0271428
         lngdppc |   3.141468   .1997311    15.73   0.000     2.750003    3.532934
           trade |  -.0027969   .0012943    -2.16   0.031    -.0053337   -.0002601
                 |
            year |
           1991  |   .1031024    .058674     1.76   0.079    -.0118966    .2181013
           1992  |  -.0473912   .0783806    -0.60   0.545    -.2010144     .106232
           1993  |  -.0941828   .0908078    -1.04   0.300    -.2721628    .0837972
           1994  |  -.1039273   .1017951    -1.02   0.307     -.303442    .0955873
           1995  |  -.2618302   .1126526    -2.32   0.020    -.4826253   -.0410351
           1996  |  -.2634064   .1234767    -2.13   0.033    -.5054164   -.0213965
           1997  |  -.3461075   .1337397    -2.59   0.010    -.6082324   -.0839826
           1998  |  -.4245638   .1444767    -2.94   0.003    -.7077329   -.1413946
           1999  |  -.4470105   .1548885    -2.89   0.004    -.7505864   -.1434346
           2000  |    -.47025   .1635148    -2.88   0.004    -.7907332   -.1497668
           2001  |  -.4914064   .1728672    -2.84   0.004    -.8302199   -.1525929
           2002  |  -.5507853   .1816841    -3.03   0.002    -.9068796    -.194691
           2003  |   -.408599   .1901528    -2.15   0.032    -.7812916   -.0359064
           2004  |  -.4292847   .1990144    -2.16   0.031    -.8193457   -.0392236
           2005  |  -.5575263   .2089318    -2.67   0.008    -.9670252   -.1480274
           2006  |  -.6179767   .2089836    -2.96   0.003    -1.027577   -.2083764
           2007  |  -.7591946   .2144366    -3.54   0.000    -1.179483   -.3389067
           2008  |  -.7876379    .218321    -3.61   0.000    -1.215539   -.3597366
           2009  |  -.9992389   .2232887    -4.48   0.000    -1.436877    -.561601
           2010  |   -.918555   .2280302    -4.03   0.000    -1.365486    -.471624
           2011  |  -.9949878   .2318501    -4.29   0.000    -1.449406     -.54057
           2012  |  -1.004869   .2367164    -4.25   0.000    -1.468824   -.5409132
           2013  |  -1.126029   .2428522    -4.64   0.000     -1.60201   -.6500472
           2014  |  -1.304717   .2486309    -5.25   0.000    -1.792024   -.8174092
           2015  |  -1.469398   .2547171    -5.77   0.000    -1.968634   -.9701612
                 |
           _cons |  -23.15057   1.652938   -14.01   0.000    -26.39027   -19.91088
-----------------+----------------------------------------------------------------
             rho |   .9545115
----------------------------------------------------------------------------------

. 
. outreg2 using output_co2FH1, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) ctitle(Model 1: PCSE
> ) drop(i.year) append
output_co2FH1.xml
dir : seeout

. 
. xtscc co2pc fh_democracy_sum lngdppc trade i.year if countryname!="Qatar", re lag(4) 
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      1738
Method: Random-effects GLS regression            Number of groups  =        75
Group variable (i): c_code                       Wald chi2(28)     =  5.77e+07
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.5776

----------------------------------------------------------------------------------
                 |             Drisc/Kraay
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0746832    .021377     3.49   0.002     .0306565    .1187099
         lngdppc |   2.120245   .2921356     7.26   0.000      1.51858     2.72191
           trade |  -.0041337   .0021459    -1.93   0.066    -.0085533    .0002859
                 |
            year |
           1990  |          0  (empty)
           1991  |   .0550962    .028507     1.93   0.065    -.0036152    .1138075
           1992  |   .0703868   .0428488     1.64   0.113     -.017862    .1586356
           1993  |   .0747488   .0398311     1.88   0.072    -.0072849    .1567825
           1994  |   .0526473   .0446302     1.18   0.249    -.0392703     .144565
           1995  |  -.0773457   .0450855    -1.72   0.099    -.1702011    .0155096
           1996  |  -.0711994   .0393985    -1.81   0.083    -.1523421    .0099433
           1997  |  -.1144577   .0417569    -2.74   0.011    -.2004575   -.0284579
           1998  |  -.1811716   .0407897    -4.44   0.000    -.2651794   -.0971637
           1999  |  -.1826664   .0428528    -4.26   0.000    -.2709234   -.0944093
           2000  |  -.2036823   .0592462    -3.44   0.002    -.3257023   -.0816624
           2001  |  -.2004038   .0587693    -3.41   0.002    -.3214414   -.0793661
           2002  |  -.2589394   .0600853    -4.31   0.000    -.3826875   -.1351913
           2003  |  -.1076461   .0642171    -1.68   0.106    -.2399037    .0246115
           2004  |  -.0899564   .0793549    -1.13   0.268     -.253391    .0734781
           2005  |  -.1931588   .0857671    -2.25   0.033    -.3697993   -.0165182
           2006  |  -.2636227   .0863582    -3.05   0.005    -.4414808   -.0857646
           2007  |  -.3522998   .1004198    -3.51   0.002    -.5591182   -.1454815
           2008  |  -.3490761   .1094766    -3.19   0.004    -.5745474   -.1236048
           2009  |  -.5841646   .0950809    -6.14   0.000    -.7799874   -.3883418
           2010  |  -.4696101   .1053766    -4.46   0.000    -.6866373   -.2525829
           2011  |  -.5184422    .118667    -4.37   0.000    -.7628415   -.2740429
           2012  |  -.4950613   .1250612    -3.96   0.001    -.7526296    -.237493
           2013  |  -.6055823    .128081    -4.73   0.000      -.86937   -.3417946
           2014  |  -.7651941   .1320202    -5.80   0.000    -1.037095   -.4932933
           2015  |  -.8924425   .1351574    -6.60   0.000    -1.170804   -.6140805
                 |
           _cons |  -14.86235    2.57202    -5.78   0.000    -20.15952   -9.565176
-----------------+----------------------------------------------------------------
         sigma_u |    2.86478
         sigma_e |  .88379484
             rho |  .91309654   (fraction of variance due to u_i)
----------------------------------------------------------------------------------


. 
. outreg2 using output_co2FH1, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1: XTSCC) drop(i.year) append
output_co2FH1.xml
dir : seeout

. 
. reg co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude if countryname!="Qatar", robust

Linear regression                                      Number of obs =    1738
                                                       F(  9,  1727) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.6942
                                                       Root MSE      =   2.716

----------------------------------------------------------------------------------
                 |               Robust
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |  -.2012225   .0237649    -8.47   0.000    -.2478336   -.1546115
         lngdppc |   2.967439   .1685989    17.60   0.000      2.63676    3.298119
           trade |   .0011207   .0021958     0.51   0.610    -.0031859    .0054273
             pop |   1.36e-09   1.91e-10     7.09   0.000     9.81e-10    1.73e-09
           urban |   -.013323   .0043719    -3.05   0.002    -.0218978   -.0047481
           renew |  -.0097866   .0030295    -3.23   0.001    -.0157284   -.0038448
          forest |  -.0063851   .0023936    -2.67   0.008    -.0110797   -.0016905
          annexI |    3.89736   .2505939    15.55   0.000     3.405861     4.38886
          island |  -.3162853   .2265509    -1.40   0.163    -.7606283    .1280578
        latitude |  -.0337758   .0610525    -0.55   0.580    -.1535205    .0859688
           _cons |   -20.4613   1.256228   -16.29   0.000    -22.92519   -17.99741
----------------------------------------------------------------------------------

. 
. outreg2 using output_co2FH2, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, No)
>  ctitle(Model 2: OLS) drop(i.year) replace
output_co2FH2.xml
dir : seeout

. 
. xtreg co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar",
>  fe
note: annexI omitted because of collinearity
note: island omitted because of collinearity
note: latitude omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =      1738
Group variable: c_code                          Number of groups   =        75

R-sq:  within  = 0.1747                         Obs per group: min =         1
       between = 0.5451                                        avg =      23.2
       overall = 0.5207                                        max =        26

                                                F(32,1631)         =     10.79
corr(u_i, Xb)  = 0.0688                         Prob > F           =    0.0000

----------------------------------------------------------------------------------
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0602745   .0201159     3.00   0.003     .0208189    .0997302
         lngdppc |   1.739087   .1466844    11.86   0.000     1.451377    2.026796
           trade |  -.0048897   .0011573    -4.23   0.000    -.0071597   -.0026197
             pop |   1.12e-09   1.20e-09     0.94   0.350    -1.23e-09    3.48e-09
           urban |   .0482741   .0103027     4.69   0.000     .0280661    .0684821
           renew |  -.0164102   .0048783    -3.36   0.001    -.0259785   -.0068418
          forest |  -.0448602    .014668    -3.06   0.002    -.0736304     -.01609
          annexI |          0  (omitted)
          island |          0  (omitted)
        latitude |          0  (omitted)
                 |
            year |
           1991  |    .040406   .1665471     0.24   0.808    -.2862627    .3670746
           1992  |   .0200926   .1639294     0.12   0.902    -.3014417     .341627
           1993  |   .0013702   .1633843     0.01   0.993    -.3190949    .3218353
           1994  |  -.0504301   .1636557    -0.31   0.758    -.3714275    .2705674
           1995  |  -.2027735   .1632064    -1.24   0.214    -.5228898    .1173428
           1996  |  -.2017686    .163841    -1.23   0.218    -.5231295    .1195923
           1997  |  -.2702314    .163927    -1.65   0.099     -.591761    .0512982
           1998  |  -.3506469   .1645148    -2.13   0.033    -.6733294   -.0279644
           1999  |  -.3647402   .1653076    -2.21   0.027    -.6889777   -.0405027
           2000  |  -.3927249   .1652144    -2.38   0.018    -.7167797   -.0686701
           2001  |  -.4118022   .1660397    -2.48   0.013    -.7374757   -.0861288
           2002  |  -.4765298   .1670345    -2.85   0.004    -.8041546    -.148905
           2003  |  -.3390787   .1683403    -2.01   0.044    -.6692646   -.0088929
           2004  |  -.3229366   .1706775    -1.89   0.059    -.6577067    .0118334
           2005  |  -.4298419   .1737605    -2.47   0.013    -.7706591   -.0890246
           2006  |   -.502004   .1754171    -2.86   0.004    -.8460705   -.1579376
           2007  |  -.5995269   .1781451    -3.37   0.001    -.9489442   -.2501095
           2008  |  -.6011443   .1805161    -3.33   0.001    -.9552121   -.2470765
           2009  |  -.8698132   .1799743    -4.83   0.000    -1.222818   -.5168082
           2010  |  -.7628955   .1825699    -4.18   0.000    -1.120992   -.4047993
           2011  |  -.8201351   .1851821    -4.43   0.000    -1.183355   -.4569152
           2012  |  -.8071646   .1870951    -4.31   0.000    -1.174137   -.4401925
           2013  |  -.9239156   .1890651    -4.89   0.000    -1.294752   -.5530795
           2014  |  -1.093818   .1910939    -5.72   0.000    -1.468634   -.7190029
           2015  |  -1.244187   .1936528    -6.42   0.000    -1.624021   -.8643524
                 |
           _cons |   -12.0618   1.384495    -8.71   0.000    -14.77738   -9.346224
-----------------+----------------------------------------------------------------
         sigma_u |  3.3601609
         sigma_e |  .86791997
             rho |   .9374554   (fraction of variance due to u_i)
----------------------------------------------------------------------------------
F test that all u_i=0:     F(74, 1631) =   247.44            Prob > F = 0.0000

. 
. xtreg co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar",
>  vce(cluster c_code)

Random-effects GLS regression                   Number of obs      =      1738
Group variable: c_code                          Number of groups   =        75

R-sq:  within  = 0.1734                         Obs per group: min =         1
       between = 0.6792                                        avg =      23.2
       overall = 0.6488                                        max =        26

                                                Wald chi2(35)      =    263.50
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                    (Std. Err. adjusted for 75 clusters in c_code)
----------------------------------------------------------------------------------
                 |               Robust
           co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0536399   .0372913     1.44   0.150    -.0194498    .1267295
         lngdppc |   1.699678   .4712459     3.61   0.000      .776053    2.623303
           trade |  -.0045038   .0021224    -2.12   0.034    -.0086637   -.0003439
             pop |   1.23e-09   1.79e-09     0.69   0.493    -2.28e-09    4.74e-09
           urban |   .0365042   .0206103     1.77   0.077    -.0038913    .0768997
           renew |   -.018799   .0084283    -2.23   0.026    -.0353181   -.0022799
          forest |  -.0252964   .0131853    -1.92   0.055     -.051139    .0005462
          annexI |   4.050049   1.278742     3.17   0.002     1.543762    6.556336
          island |  -.9910741   .8972782    -1.10   0.269    -2.749707    .7675588
        latitude |   -.155236   .3125503    -0.50   0.619    -.7678233    .4573513
                 |
            year |
           1991  |   .0462247   .1005109     0.46   0.646    -.1507729    .2432224
           1992  |   .0397932   .2554388     0.16   0.876    -.4608576     .540444
           1993  |   .0202182   .2660861     0.08   0.939     -.501301    .5417373
           1994  |  -.0288549   .2765908    -0.10   0.917    -.5709629    .5132531
           1995  |  -.1747162   .2721398    -0.64   0.521    -.7081003     .358668
           1996  |  -.1668789   .2928988    -0.57   0.569      -.74095    .4071922
           1997  |   -.233869    .301091    -0.78   0.437    -.8239966    .3562586
           1998  |   -.311344    .310184    -1.00   0.316    -.9192934    .2966054
           1999  |  -.3210936   .3130494    -1.03   0.305    -.9346592    .2924719
           2000  |  -.3438341   .3362842    -1.02   0.307    -1.002939    .3152707
           2001  |  -.3591244   .3420785    -1.05   0.294    -1.029586    .3113373
           2002  |  -.4159736   .3589969    -1.16   0.247    -1.119595    .2876475
           2003  |  -.2740273   .3672075    -0.75   0.456    -.9937409    .4456863
           2004  |  -.2539706   .3924991    -0.65   0.518    -1.023255    .5153135
           2005  |  -.3541792   .4063678    -0.87   0.383    -1.150646    .4422871
           2006  |  -.4200682   .4301131    -0.98   0.329    -1.263074    .4229381
           2007  |  -.5142023   .4277984    -1.20   0.229    -1.352672    .3242671
           2008  |  -.5112586   .4427416    -1.15   0.248    -1.379016     .356499
           2009  |  -.7726754    .466221    -1.66   0.097    -1.686452     .141101
           2010  |  -.6616323   .4670749    -1.42   0.157    -1.577082    .2538178
           2011  |  -.7162612   .4554664    -1.57   0.116    -1.608959    .1764366
           2012  |  -.7002947   .4681009    -1.50   0.135    -1.617756    .2171662
           2013  |  -.8115548   .4839133    -1.68   0.094    -1.760007    .1368979
           2014  |  -.9771118   .5005291    -1.95   0.051    -1.958131    .0039072
           2015  |  -1.122717   .5261375    -2.13   0.033    -2.153927   -.0915061
                 |
           _cons |  -11.93545   3.675897    -3.25   0.001    -19.14007   -4.730819
-----------------+----------------------------------------------------------------
         sigma_u |  2.7393868
         sigma_e |  .86791997
             rho |  .90877592   (fraction of variance due to u_i)
----------------------------------------------------------------------------------

. 
. outreg2 using output_co2FH2, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: GLS, Random) drop(i.year) append
output_co2FH2.xml
dir : seeout

. 
. xtpcse co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar"
> , corr(ar1) pairwise  
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])
(note: at least one disturbance covariance assumed 0, no common time periods
       between panels)
Warning:  variance matrix is nonsymmetric or highly singular

Prais-Winsten regression, correlated panels corrected standard errors (PCSEs)

Group variable:   c_code                        Number of obs      =      1738
Time variable:    year                          Number of groups   =        75
Panels:           correlated (unbalanced)       Obs per group: min =         1
Autocorrelation:  common AR(1)                                 avg =  23.17333
Sigma computed by pairwise selection                           max =        26
Estimated covariances      =      2850          R-squared          =    0.4039
Estimated autocorrelations =         1          Wald chi2(0)       =         .
Estimated coefficients     =        36          Prob > chi2        =         .

----------------------------------------------------------------------------------
                 |           Panel-corrected
           co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |  -.0176184          .        .       .            .           .
         lngdppc |   2.068825          .        .       .            .           .
           trade |  -.0030682          .        .       .            .           .
             pop |   1.47e-09          .        .       .            .           .
           urban |  -.0023115          .        .       .            .           .
           renew |  -.0280251          .        .       .            .           .
          forest |  -.0054053          .        .       .            .           .
          annexI |   4.174599          .        .       .            .           .
          island |  -1.332367          .        .       .            .           .
        latitude |  -.0170904          .        .       .            .           .
                 |
            year |
           1991  |   .0802601          .        .       .            .           .
           1992  |  -.0526809          .        .       .            .           .
           1993  |  -.0920509          .        .       .            .           .
           1994  |  -.1262372          .        .       .            .           .
           1995  |   -.269659          .        .       .            .           .
           1996  |  -.2405724          .        .       .            .           .
           1997  |  -.3252134          .        .       .            .           .
           1998  |  -.3939141          .        .       .            .           .
           1999  |  -.3983928          .        .       .            .           .
           2000  |  -.3938017          .        .       .            .           .
           2001  |  -.4111244          .        .       .            .           .
           2002  |  -.4417251          .        .       .            .           .
           2003  |  -.2894275          .        .       .            .           .
           2004  |  -.2730975          .        .       .            .           .
           2005  |  -.3650014          .        .       .            .           .
           2006  |  -.3768373          .        .       .            .           .
           2007  |  -.4866665          .        .       .            .           .
           2008  |  -.4843816          .        .       .            .           .
           2009  |  -.7183724          .        .       .            .           .
           2010  |  -.6097522          .        .       .            .           .
           2011  |  -.6652605          .        .       .            .           .
           2012  |  -.6574462          .        .       .            .           .
           2013  |  -.7570837          .        .       .            .           .
           2014  |   -.919096          .        .       .            .           .
           2015  |  -1.078485          .        .       .            .           .
                 |
           _cons |  -13.31953          .        .       .            .           .
-----------------+----------------------------------------------------------------
             rho |   .9469792
----------------------------------------------------------------------------------

. 
. outreg2 using output_co2FH2, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: PCSE) drop(i.year) append
output_co2FH2.xml
dir : seeout

. 
. xtscc co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar",
>  re lag(4)
no room to add more variables
    Up to 2,048 variables are allowed with this version of Stata.  Versions are available that allow up to 32,767
    variables.
r(900);

. 
. outreg2 using output_co2FH2, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 2: XTSCC) drop(i.year) append
matrix e(b) not found; run/post a regression, or specify varlist for non-regression outputs
r(111);

. 
. drop v2xdl_delib v2xdl_delib_codelow v2xdl_delib_codehigh v2xdl_delib_sd v2x_egal v2x_egal_codelow v2x_egal_codehigh v2x
> _egal_sd v2xeg_eqprotec v2xeg_eqprotec_codelow v2xeg_eqprotec_codehigh v2xeg_eqprotec_sd v2xeg_eqaccess v2xeg_eqaccess_c
> odelow v2xeg_eqaccess_codehigh v2xeg_eqaccess_sd v2xeg_eqdr v2xeg_eqdr_codelow v2xeg_eqdr_codehigh v2xeg_eqdr_sd v2elemb
> aut v2elembaut_codelow v2elembaut_codehigh v2elembaut_sd v2elembaut_osp v2elembaut_osp_codelow v2elembaut_osp_codehigh v
> 2elembaut_osp_sd v2elembaut_ord v2elembaut_ord_codelow v2elembaut_ord_codehigh v2elembaut_mean v2elembaut_nr 

. 
. xtscc co2pc fh_democracy_sum lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar",
>  re lag(4)
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      1738
Method: Random-effects GLS regression            Number of groups  =        75
Group variable (i): c_code                       Wald chi2(32)     =4523711.84
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.6488

----------------------------------------------------------------------------------
                 |             Drisc/Kraay
           co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
fh_democracy_sum |   .0536399   .0147023     3.65   0.001     .0233598    .0839199
         lngdppc |   1.699678   .2874246     5.91   0.000     1.107716     2.29164
           trade |  -.0045038   .0020433    -2.20   0.037    -.0087121   -.0002955
             pop |   1.23e-09   6.50e-10     1.89   0.070    -1.09e-10    2.57e-09
           urban |   .0365042   .0048675     7.50   0.000     .0264793    .0465291
           renew |   -.018799   .0040135    -4.68   0.000     -.027065    -.010533
          forest |  -.0252964   .0159389    -1.59   0.125    -.0581231    .0075303
          annexI |   4.050049      3.532     1.15   0.262     -3.22424    11.32434
          island |  -.9910741   1.831708    -0.54   0.593    -4.763547    2.781398
        latitude |   -.155236   .5135067    -0.30   0.765    -1.212823    .9023508
                 |
            year |
           1990  |          0  (empty)
           1991  |   .0462247   .0218965     2.11   0.045      .001128    .0913215
           1992  |   .0397932   .0336757     1.18   0.248    -.0295632    .1091496
           1993  |   .0202182   .0317137     0.64   0.530    -.0450975    .0855338
           1994  |  -.0288549   .0351887    -0.82   0.420    -.1013274    .0436176
           1995  |  -.1747162   .0337043    -5.18   0.000    -.2441314   -.1053009
           1996  |  -.1668789    .030607    -5.45   0.000    -.2299152   -.1038426
           1997  |   -.233869   .0281597    -8.31   0.000     -.291865   -.1758729
           1998  |   -.311344   .0320717    -9.71   0.000    -.3773969   -.2452911
           1999  |  -.3210936   .0375145    -8.56   0.000    -.3983563    -.243831
           2000  |  -.3438341     .04696    -7.32   0.000    -.4405501   -.2471182
           2001  |  -.3591244   .0538975    -6.66   0.000    -.4701284   -.2481203
           2002  |  -.4159736   .0595166    -6.99   0.000    -.5385503   -.2933968
           2003  |  -.2740273   .0654767    -4.19   0.000     -.408879   -.1391756
           2004  |  -.2539706   .0760477    -3.34   0.003    -.4105938   -.0973474
           2005  |  -.3541792   .0877738    -4.04   0.000    -.5349527   -.1734057
           2006  |  -.4200682   .1091095    -3.85   0.001    -.6447835   -.1953529
           2007  |  -.5142023   .1210751    -4.25   0.000    -.7635612   -.2648434
           2008  |  -.5112586    .126972    -4.03   0.000    -.7727622   -.2497549
           2009  |  -.7726754   .1315911    -5.87   0.000    -1.043692   -.5016584
           2010  |  -.6616323   .1393129    -4.75   0.000    -.9485526   -.3747119
           2011  |  -.7162612   .1453262    -4.93   0.000    -1.015566   -.4169562
           2012  |  -.7002947   .1503677    -4.66   0.000    -1.009983   -.3906067
           2013  |  -.8115548   .1575745    -5.15   0.000    -1.136086    -.487024
           2014  |  -.9771118   .1645384    -5.94   0.000    -1.315985   -.6382386
           2015  |  -1.122717   .1744297    -6.44   0.000    -1.481961    -.763472
                 |
           _cons |  -11.93545    2.87382    -4.15   0.000    -17.85419   -6.016703
-----------------+----------------------------------------------------------------
         sigma_u |  2.7393868
         sigma_e |  .86791997
             rho |  .90877592   (fraction of variance due to u_i)
----------------------------------------------------------------------------------


. 
. log close
      name:  <unnamed>
       log:  C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Log
>  file_Empirical Analysis_Final Version\Log file_Democracy_Freedom House_TSCS_Oct11,2020.log
  log type:  text
 closed on:  11 Oct 2020, 12:09:52
--------------------------------------------------------------------------------------------------------------------------
