--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Log
>  file_Empirical Analysis_Final Version\Democracy\Log file_Democracy_V-dem_TSCS_Oct15,2020.log
  log type:  text
 opened on:  15 Oct 2020, 13:50:44

. clear all

. 
. set more off 

. 
. pause on

. 
. use "C:\Users\Muinul\Desktop\muinul.democracy.dta", clear

. 
. global id c_code

. 
. global t year

. 
. sort $id $t

. 
. xtset $id $t, yearly
       panel variable:  c_code (unbalanced)
        time variable:  year, 1789 to 2020, but with gaps
                delta:  1 year

. 
. xtdescribe

  c_code:  1, 2, ..., 381                                    n =        381
    year:  1789, 1790, ..., 2020                             T =        232
           Delta(year) = 1 year
           Span(year)  = 232 periods
           (c_code*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         5      46      61        79       121     232     232

     Freq.  Percent    Cum. |  Pattern*
 ---------------------------+---------------------------------------------------------------------------------------------
> --------------------------
       55     14.44   14.44 |  .....................................................................................122222
> 2222222222222222222222222
       50     13.12   27.56 |  .......................................................122222222222222222222222222222222222
> 2222222222222222222222222
       37      9.71   37.27 |  2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222
> 2222222222222222222222222
       20      5.25   42.52 |  ...........................................................................................
> 122222222222222222222221.
       17      4.46   46.98 |  ...........................................................................................
> 122222222222222222222222.
       12      3.15   50.13 |  .....................................................................................122222
> 222222222222222222222222.
        9      2.36   52.49 |  .....12222222222222222222222222222222222222222222222222222222222222222222222222222222222222
> 222222222222222222222222.
        4      1.05   53.54 |  ........................1222222222222222222222222222222222222222222222222222222222222222222
> 2222222222222222222222222
        4      1.05   54.59 |  222222222222222222222222222222222222222221.................................................
> .........................
      173     45.41  100.00 | (other patterns)
 ---------------------------+---------------------------------------------------------------------------------------------
> --------------------------
      381    100.00         |  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
> XXXXXXXXXXXXXXXXXXXXXXXXX
 -------------------------------------------------------------------------------------------------------------------------
> --------------------------
 *Each column represents 2 periods.


. 
. * ln CO2 per capita

. 
. gen lnco2pc = ln(co2pc)
(30872 missing values generated)

. 
. * ln GDP per capita

. 
. gen lngdppc = log(gdppc)
(35641 missing values generated)

. 
. * GDP per capita squared

. 
. gen lngdppc2 = lngdppc*lngdppc
(35641 missing values generated)

. 
. * ln Population, Total

. 
. gen lnpop = log(pop)
(28429 missing values generated)

. 
. drop if missing(co2pc)
(30871 observations deleted)

. 
. drop if missing(lngdppc)
(5449 observations deleted)

. 
. drop if missing(trade)
(329 observations deleted)

. 
. drop if missing(pop)
(0 observations deleted)

. 
. drop if missing(urban)
(9 observations deleted)

. 
. drop if missing(renew)
(185 observations deleted)

. 
. drop if missing(forest)
(100 observations deleted)

. 
. drop if missing(annexI)
(0 observations deleted)

. 
. drop if missing(island)
(0 observations deleted)

. 
. drop if missing(latitude)
(22 observations deleted)

. 
. drop if missing(fedfof)
(0 observations deleted)

. 
. drop if missing(v2x_polyarchy)
(362 observations deleted)

. 
. xtreg co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude, re vce (cluster c_code)

Random-effects GLS regression                   Number of obs      =      3789
Group variable: c_code                          Number of groups   =       160

R-sq:  within  = 0.0707                         Obs per group: min =         3
       between = 0.4464                                        avg =      23.7
       overall = 0.4561                                        max =        26

                                                Wald chi2(10)      =    220.57
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                (Std. Err. adjusted for 160 clusters in c_code)
-------------------------------------------------------------------------------
              |               Robust
        co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -.5806667   .4691914    -1.24   0.216    -1.500265    .3389316
      lngdppc |   1.035293   .2931204     3.53   0.000     .4607874    1.609798
        trade |  -.0054688   .0031492    -1.74   0.082    -.0116411    .0007035
          pop |  -9.31e-10   1.82e-09    -0.51   0.609    -4.50e-09    2.64e-09
        urban |   .0163994   .0154164     1.06   0.287    -.0138162     .046615
        renew |  -.0336817   .0076545    -4.40   0.000    -.0486842   -.0186792
       forest |  -.0042343   .0101817    -0.42   0.678    -.0241901    .0157215
       annexI |   1.920596   1.106865     1.74   0.083    -.2488199    4.090011
       island |   .4802367   1.067245     0.45   0.653    -1.611524    2.571998
     latitude |   .5101782   .3016392     1.69   0.091    -.0810238     1.10138
        _cons |  -5.527597   2.502248    -2.21   0.027    -10.43191   -.6232814
--------------+----------------------------------------------------------------
      sigma_u |  4.0431591
      sigma_e |  1.1788014
          rho |  .92165554   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. predict e, e

. 
. predict u, u

. 
. predict ue, ue  

. 
. kdensity e, norm

. 
. kdensity u, norm

. 
. kdensity ue, norm

. 
. pnorm e

. 
. pnorm u

. 
. pnorm ue

. 
. qnorm e

. 
. qnorm u

. 
. qnorm ue, mlabel(countryname)

. 
. predict e1 if countryname!="Qatar", e
(16 missing values generated)

. 
. predict u1 if countryname!="Qatar", u
(16 missing values generated)

. 
. predict ue1 if countryname!="Qatar", ue
(16 missing values generated)

. 
. kdensity e1 if countryname!="Qatar", norm

. 
. kdensity u1 if countryname!="Qatar", norm

. 
. kdensity ue1 if countryname!="Qatar", norm

. 
. pnorm e1 if countryname!="Qatar"

. 
. pnorm u1 if countryname!="Qatar"

. 
. pnorm ue1 if countryname!="Qatar"

. 
. qnorm e1 if countryname!="Qatar"

. 
. qnorm u1 if countryname!="Qatar"

. 
. qnorm ue1 if countryname!="Qatar", mlabel(countryname)

. 
. reg co2pc v2x_polyarchy lngdppc trade

      Source |       SS       df       MS              Number of obs =    3789
-------------+------------------------------           F(  3,  3785) = 1603.82
       Model |  76240.4071     3   25413.469           Prob > F      =  0.0000
    Residual |  59975.5889  3785  15.8455981           R-squared     =  0.5597
-------------+------------------------------           Adj R-squared =  0.5594
       Total |  136215.996  3788  35.9598723           Root MSE      =  3.9807

-------------------------------------------------------------------------------
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -6.753284   .2839704   -23.78   0.000    -7.310034   -6.196535
      lngdppc |    4.25484   .0650365    65.42   0.000      4.12733    4.382349
        trade |  -.0038506    .001395    -2.76   0.006    -.0065856   -.0011156
        _cons |  -30.05642   .5070764   -59.27   0.000    -31.05059   -29.06225
-------------------------------------------------------------------------------

. 
. reg co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude

      Source |       SS       df       MS              Number of obs =    3789
-------------+------------------------------           F( 10,  3778) =  525.50
       Model |  79244.2432    10  7924.42432           Prob > F      =  0.0000
    Residual |  56971.7529  3778  15.0798711           R-squared     =  0.5818
-------------+------------------------------           Adj R-squared =  0.5806
       Total |  136215.996  3788  35.9598723           Root MSE      =  3.8833

-------------------------------------------------------------------------------
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -7.559511   .3207741   -23.57   0.000    -8.188419   -6.930604
      lngdppc |   3.421452   .1232698    27.76   0.000      3.17977    3.663134
        trade |  -.0016196   .0014457    -1.12   0.263     -.004454    .0012148
          pop |   1.00e-09   4.57e-10     2.19   0.028     1.07e-10    1.90e-09
        urban |   .0360038   .0051464     7.00   0.000     .0259139    .0460937
        renew |   .0057457   .0034961     1.64   0.100    -.0011087       .0126
       forest |  -.0230955   .0032089    -7.20   0.000    -.0293869   -.0168041
       annexI |   1.542612   .2250306     6.86   0.000     1.101419    1.983805
       island |   .7289773   .1912081     3.81   0.000     .3540961    1.103858
     latitude |   .1462685   .0909182     1.61   0.108    -.0319851     .324522
        _cons |  -24.69475   1.048533   -23.55   0.000    -26.75049     -22.639
-------------------------------------------------------------------------------

. 
. lvr2plot, mlabel(countryname)

. 
. xtline co2pc if v2x_polyarchy >=.90, overlay

. 
. reg co2pc v2x_polyarchy lngdppc trade if countryname!="Qatar", robust

Linear regression                                      Number of obs =    3773
                                                       F(  3,  3769) = 1195.69
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6015
                                                       Root MSE      =  3.2576

-------------------------------------------------------------------------------
              |               Robust
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -4.626808   .3756086   -12.32   0.000    -5.363224   -3.890392
      lngdppc |   3.749569   .0884844    42.38   0.000     3.576088    3.923051
        trade |  -.0010086   .0014924    -0.68   0.499    -.0039346    .0019174
        _cons |  -27.01413   .5895206   -45.82   0.000    -28.16994   -25.85832
-------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, No)
>  ctitle(Model 1) drop(i.year) replace
output_co2fed.xml
dir : seeout

. 
. xtreg co2pc v2x_polyarchy lngdppc trade i.year if countryname!="Qatar", fe

Fixed-effects (within) regression               Number of obs      =      3773
Group variable: c_code                          Number of groups   =       159

R-sq:  within  = 0.1061                         Obs per group: min =         3
       between = 0.5564                                        avg =      23.7
       overall = 0.5373                                        max =        26

                                                F(28,3586)         =     15.21
corr(u_i, Xb)  = 0.4217                         Prob > F           =    0.0000

-------------------------------------------------------------------------------
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |   .5077809   .2121875     2.39   0.017     .0917606    .9238012
      lngdppc |   1.845327    .102887    17.94   0.000     1.643604     2.04705
        trade |  -.0048076   .0009052    -5.31   0.000    -.0065823    -.003033
              |
         year |
        1991  |   .0209343   .1294065     0.16   0.871    -.2327834     .274652
        1992  |    .069978   .1270272     0.55   0.582    -.1790749    .3190309
        1993  |   .1190944   .1266822     0.94   0.347    -.1292819    .3674707
        1994  |   .0914806   .1259556     0.73   0.468    -.1554712    .3384324
        1995  |   .0425717   .1250116     0.34   0.733    -.2025292    .2876725
        1996  |    .067144    .125118     0.54   0.592    -.1781655    .3124535
        1997  |   .0405661   .1253947     0.32   0.746    -.2052861    .2864182
        1998  |  -.0365224   .1255835    -0.29   0.771    -.2827446    .2096998
        1999  |  -.0953418    .125596    -0.76   0.448    -.3415884    .1509049
        2000  |  -.0959614   .1250542    -0.77   0.443    -.3411458    .1492231
        2001  |  -.0799148   .1251103    -0.64   0.523    -.3252093    .1653797
        2002  |  -.1528556   .1254467    -1.22   0.223    -.3988097    .0930984
        2003  |  -.0457382   .1259936    -0.36   0.717    -.2927644    .2012881
        2004  |  -.0272949   .1270948    -0.21   0.830    -.2764801    .2218903
        2005  |  -.0734236   .1281472    -0.57   0.567    -.3246723     .177825
        2006  |  -.0927555   .1292223    -0.72   0.473    -.3461121    .1606011
        2007  |  -.1742864   .1305832    -1.33   0.182    -.4303112    .0817384
        2008  |  -.1624484   .1318056    -1.23   0.218    -.4208698     .095973
        2009  |   -.412386   .1302053    -3.17   0.002    -.6676698   -.1571022
        2010  |  -.3382878   .1314553    -2.57   0.010    -.5960224   -.0805532
        2011  |  -.4090262   .1330057    -3.08   0.002    -.6698005   -.1482518
        2012  |  -.4163903   .1340938    -3.11   0.002    -.6792981   -.1534825
        2013  |  -.5009463   .1343166    -3.73   0.000     -.764291   -.2376017
        2014  |  -.6473236   .1347588    -4.80   0.000    -.9115351    -.383112
        2015  |  -.7499901    .135466    -5.54   0.000    -1.015588   -.4843919
              |
        _cons |  -12.09851   .9208663   -13.14   0.000    -13.90398   -10.29304
--------------+----------------------------------------------------------------
      sigma_u |   3.833299
      sigma_e |  .97323042
          rho |  .93944404   (fraction of variance due to u_i)
-------------------------------------------------------------------------------
F test that all u_i=0:     F(158, 3586) =   240.60           Prob > F = 0.0000

. 
. xtreg co2pc v2x_polyarchy lngdppc trade i.year if countryname!="Qatar", vce(cluster c_code)  

Random-effects GLS regression                   Number of obs      =      3773
Group variable: c_code                          Number of groups   =       159

R-sq:  within  = 0.1054                         Obs per group: min =         3
       between = 0.5658                                        avg =      23.7
       overall = 0.5459                                        max =        26

                                                Wald chi2(28)      =    181.55
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                (Std. Err. adjusted for 159 clusters in c_code)
-------------------------------------------------------------------------------
              |               Robust
        co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |   .4368731   .3993672     1.09   0.274    -.3458721    1.219618
      lngdppc |   2.145708   .3339514     6.43   0.000     1.491175    2.800241
        trade |  -.0042118   .0029706    -1.42   0.156    -.0100341    .0016104
              |
         year |
        1991  |   .0241761   .0618044     0.39   0.696    -.0969583    .1453105
        1992  |   .0701842    .129126     0.54   0.587    -.1828981    .3232666
        1993  |   .1218142   .1289498     0.94   0.345    -.1309228    .3745513
        1994  |   .0952612   .1342916     0.71   0.478    -.1679456     .358468
        1995  |   .0430324   .1370778     0.31   0.754    -.2256351    .3116999
        1996  |   .0584735   .1396133     0.42   0.675    -.2151635    .3321105
        1997  |   .0234501    .142971     0.16   0.870     -.256768    .3036682
        1998  |  -.0584157   .1469728    -0.40   0.691    -.3464772    .2296457
        1999  |   -.121944   .1525141    -0.80   0.424    -.4208661    .1769781
        2000  |  -.1317425   .1637376    -0.80   0.421    -.4526623    .1891773
        2001  |  -.1196984   .1717294    -0.70   0.486    -.4562819     .216885
        2002  |  -.1981038   .1739432    -1.14   0.255    -.5390261    .1428185
        2003  |  -.0981751   .1861116    -0.53   0.598    -.4629472     .266597
        2004  |   -.094723   .1913589    -0.50   0.621    -.4697796    .2803337
        2005  |  -.1531002   .1949668    -0.79   0.432    -.5352281    .2290278
        2006  |  -.1857262   .2129818    -0.87   0.383    -.6031628    .2317104
        2007  |  -.2815353   .2171149    -1.30   0.195    -.7070726    .1440021
        2008  |  -.2782539   .2182475    -1.27   0.202    -.7060112    .1495034
        2009  |  -.5171214   .2281795    -2.27   0.023    -.9643451   -.0698978
        2010  |  -.4547926   .2356747    -1.93   0.054    -.9167065    .0071214
        2011  |  -.5337323   .2395972    -2.23   0.026    -1.003334   -.0641304
        2012  |  -.5493196   .2465713    -2.23   0.026    -1.032591   -.0660487
        2013  |  -.6386678   .2543375    -2.51   0.012     -1.13716   -.1401754
        2014  |  -.7902361   .2650716    -2.98   0.003    -1.309767   -.2707053
        2015  |  -.8970663   .2822453    -3.18   0.001    -1.450257   -.3438758
              |
        _cons |  -14.68326   2.652041    -5.54   0.000    -19.88117   -9.485356
--------------+----------------------------------------------------------------
      sigma_u |    3.06148
      sigma_e |  .97323042
          rho |  .90821779   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1) drop(i.year) append
output_co2fed.xml
dir : seeout

. 
. xtpcse co2pc v2x_polyarchy lngdppc trade i.year if countryname!="Qatar", corr(ar1) pairwise 
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])
(note: at least one disturbance covariance assumed 0, no common time periods
       between panels)

Prais-Winsten regression, correlated panels corrected standard errors (PCSEs)

Group variable:   c_code                        Number of obs      =      3773
Time variable:    year                          Number of groups   =       159
Panels:           correlated (unbalanced)       Obs per group: min =         3
Autocorrelation:  common AR(1)                                 avg =  23.72956
Sigma computed by pairwise selection                           max =        26
Estimated covariances      =     12720          R-squared          =    0.2833
Estimated autocorrelations =         1          Wald chi2(28)      =    672.32
Estimated coefficients     =        29          Prob > chi2        =    0.0000

-------------------------------------------------------------------------------
              |           Panel-corrected
        co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -.9974163   .2214699    -4.50   0.000    -1.431489   -.5633432
      lngdppc |    3.02388   .1434764    21.08   0.000     2.742672    3.305089
        trade |  -.0010439    .001203    -0.87   0.386    -.0034016    .0013139
              |
         year |
        1991  |   .0809839   .0549112     1.47   0.140    -.0266401    .1886079
        1992  |  -.0040155   .0752129    -0.05   0.957    -.1514301    .1433991
        1993  |   .0720803   .0874973     0.82   0.410    -.0994114    .2435719
        1994  |   .0628632   .0973451     0.65   0.518    -.1279297    .2536562
        1995  |  -.0575191   .1052228    -0.55   0.585     -.263752    .1487138
        1996  |  -.0595318   .1111369    -0.54   0.592    -.2773561    .1582924
        1997  |  -.1105279   .1173069    -0.94   0.346    -.3404452    .1193894
        1998  |  -.1947284   .1228784    -1.58   0.113    -.4355658    .0461089
        1999  |  -.2561013   .1282869    -2.00   0.046    -.5075389   -.0046637
        2000  |  -.2881778   .1334875    -2.16   0.031    -.5498085   -.0265471
        2001  |  -.3182758   .1350191    -2.36   0.018    -.5829083   -.0536433
        2002  |  -.4045411   .1385148    -2.92   0.003    -.6760251   -.1330571
        2003  |  -.3233307   .1423011    -2.27   0.023    -.6022357   -.0444257
        2004  |  -.3701818   .1471191    -2.52   0.012    -.6585299   -.0818336
        2005  |  -.4698648   .1504726    -3.12   0.002    -.7647858   -.1749439
        2006  |  -.5373297    .154415    -3.48   0.001    -.8399776   -.2346819
        2007  |  -.6762759   .1585226    -4.27   0.000    -.9869745   -.3655773
        2008  |  -.6953921   .1623598    -4.28   0.000    -1.013612   -.3771728
        2009  |  -.8855782   .1607176    -5.51   0.000    -1.200579   -.5705776
        2010  |  -.8653301   .1651049    -5.24   0.000     -1.18893   -.5417305
        2011  |  -.9623201   .1694612    -5.68   0.000    -1.294458   -.6301823
        2012  |  -1.000386   .1730177    -5.78   0.000    -1.339494   -.6612774
        2013  |  -1.104224   .1757131    -6.28   0.000    -1.448615   -.7598324
        2014  |  -1.272364   .1784924    -7.13   0.000    -1.622203    -.922525
        2015  |  -1.396789   .1797996    -7.77   0.000     -1.74919   -1.044388
              |
        _cons |  -21.81777   1.209449   -18.04   0.000    -24.18825    -19.4473
--------------+----------------------------------------------------------------
          rho |   .9555464
-------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) ctitle(Model 1) drop
> (i.year) append
output_co2fed.xml
dir : seeout

. 
. xtscc co2pc v2x_polyarchy lngdppc trade i.year if countryname!="Qatar", re lag(4) 
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      3773
Method: Random-effects GLS regression            Number of groups  =       159
Group variable (i): c_code                       Wald chi2(28)     =1400121.25
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.5459

-------------------------------------------------------------------------------
              |             Drisc/Kraay
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |   .4368731   .3310563     1.32   0.199      -.24495    1.118696
      lngdppc |   2.145708   .2191943     9.79   0.000     1.694269    2.597147
        trade |  -.0042118   .0016002    -2.63   0.014    -.0075075   -.0009162
              |
         year |
        1990  |          0  (empty)
        1991  |   .0241761    .027108     0.89   0.381    -.0316538    .0800061
        1992  |   .0701842   .0507996     1.38   0.179    -.0344395     .174808
        1993  |   .1218142   .0595013     2.05   0.051    -.0007311    .2443595
        1994  |   .0952612    .063939     1.49   0.149    -.0364236    .2269459
        1995  |   .0430324   .0705556     0.61   0.547    -.1022796    .1883444
        1996  |   .0584735   .0680438     0.86   0.398    -.0816653    .1986123
        1997  |   .0234501   .0709399     0.33   0.744    -.1226533    .1695535
        1998  |  -.0584157   .0701441    -0.83   0.413    -.2028803    .0860488
        1999  |   -.121944   .0681277    -1.79   0.086    -.2622556    .0183676
        2000  |  -.1317425   .0746264    -1.77   0.090    -.2854386    .0219535
        2001  |  -.1196984   .0745578    -1.61   0.121    -.2732531    .0338562
        2002  |  -.1981038   .0774566    -2.56   0.017    -.3576287   -.0385789
        2003  |  -.0981751   .0803453    -1.22   0.233    -.2636493    .0672991
        2004  |   -.094723   .0872879    -1.09   0.288    -.2744957    .0850497
        2005  |  -.1531002    .095828    -1.60   0.123    -.3504615    .0442612
        2006  |  -.1857262   .1046562    -1.77   0.088    -.4012697    .0298173
        2007  |  -.2815353   .1120076    -2.51   0.019    -.5122193   -.0508513
        2008  |  -.2782539   .1179493    -2.36   0.026     -.521175   -.0353328
        2009  |  -.5171214   .1106103    -4.68   0.000    -.7449275   -.2893153
        2010  |  -.4547926   .1171784    -3.88   0.001     -.696126   -.2134591
        2011  |  -.5337323   .1254049    -4.26   0.000    -.7920085   -.2754561
        2012  |  -.5493196   .1300101    -4.23   0.000    -.8170805   -.2815587
        2013  |  -.6386678   .1312533    -4.87   0.000    -.9089891   -.3683465
        2014  |  -.7902361   .1329988    -5.94   0.000    -1.064152     -.51632
        2015  |  -.8970663   .1338986    -6.70   0.000    -1.172836   -.6212969
              |
        _cons |  -14.68326   1.790939    -8.20   0.000    -18.37177   -10.99475
--------------+----------------------------------------------------------------
      sigma_u |    3.06148
      sigma_e |  .97323042
          rho |  .90821779   (fraction of variance due to u_i)
-------------------------------------------------------------------------------


. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1) drop(i.year) append
output_co2fed.xml
dir : seeout

. 
. reg co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude if countryname!="Qatar", robust

Linear regression                                      Number of obs =    3773
                                                       F(  9,  3762) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.6350
                                                       Root MSE      =  3.1208

-------------------------------------------------------------------------------
              |               Robust
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -5.766961   .3404043   -16.94   0.000    -6.434356   -5.099566
      lngdppc |   2.697187   .1270664    21.23   0.000     2.448061    2.946313
        trade |   .0007681   .0016174     0.47   0.635     -.002403    .0039391
          pop |   1.27e-09   2.40e-10     5.28   0.000     7.97e-10    1.74e-09
        urban |   .0312197   .0038466     8.12   0.000     .0236781    .0387613
        renew |    -.00508   .0027965    -1.82   0.069    -.0105628    .0004028
       forest |  -.0162766   .0022581    -7.21   0.000    -.0207038   -.0118495
       annexI |   2.106052   .1968664    10.70   0.000     1.720076    2.492027
       island |   .8207878   .1738333     4.72   0.000      .479971    1.161604
     latitude |   .1433668   .0558423     2.57   0.010     .0338827    .2528509
        _cons |  -19.16587   1.066923   -17.96   0.000    -21.25767   -17.07407
-------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, No)
>  ctitle(Model 1) drop(i.year) replace
output_co2fed.xml
dir : seeout

. 
. xtreg co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", fe
note: annexI omitted because of collinearity
note: island omitted because of collinearity
note: latitude omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =      3773
Group variable: c_code                          Number of groups   =       159

R-sq:  within  = 0.1478                         Obs per group: min =         3
       between = 0.5810                                        avg =      23.7
       overall = 0.5636                                        max =        26

                                                F(32,3582)         =     19.42
corr(u_i, Xb)  = 0.0391                         Prob > F           =    0.0000

-------------------------------------------------------------------------------
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |   .1387121   .2094365     0.66   0.508    -.2719146    .5493389
      lngdppc |   1.669361   .1073826    15.55   0.000     1.458824    1.879898
        trade |  -.0044054   .0008869    -4.97   0.000    -.0061444   -.0026664
          pop |   6.28e-11   1.24e-09     0.05   0.959    -2.36e-09    2.48e-09
        urban |   .0560884   .0070391     7.97   0.000     .0422874    .0698895
        renew |  -.0251877   .0033117    -7.61   0.000    -.0316807   -.0186947
       forest |  -.0129624   .0083336    -1.56   0.120    -.0293015    .0033768
       annexI |          0  (omitted)
       island |          0  (omitted)
     latitude |          0  (omitted)
              |
         year |
        1991  |   .0041177   .1264534     0.03   0.974    -.2438101    .2520456
        1992  |  -.0057182   .1243139    -0.05   0.963    -.2494513    .2380148
        1993  |   .0156106   .1241804     0.13   0.900    -.2278607    .2590819
        1994  |  -.0362337   .1236582    -0.29   0.770    -.2786812    .2062139
        1995  |  -.1132112   .1230439    -0.92   0.358    -.3544544     .128032
        1996  |  -.1096803   .1233815    -0.89   0.374    -.3515852    .1322247
        1997  |  -.1598098    .123891    -1.29   0.197    -.4027138    .0830942
        1998  |  -.2579531   .1243443    -2.07   0.038    -.5017459   -.0141603
        1999  |   -.331159   .1246776    -2.66   0.008    -.5756051   -.0867129
        2000  |   -.342359   .1245187    -2.75   0.006    -.5864938   -.0982243
        2001  |  -.3496389   .1250091    -2.80   0.005     -.594735   -.1045428
        2002  |  -.4335744   .1258238    -3.45   0.001    -.6802679   -.1868809
        2003  |  -.3488507   .1268787    -2.75   0.006    -.5976124    -.100089
        2004  |  -.3463421   .1285421    -2.69   0.007    -.5983651   -.0943191
        2005  |    -.40516    .130255    -3.11   0.002    -.6605415   -.1497786
        2006  |  -.4395781   .1319895    -3.33   0.001    -.6983602    -.180796
        2007  |  -.5521158   .1339174    -4.12   0.000    -.8146778   -.2895538
        2008  |  -.5530661   .1358569    -4.07   0.000    -.8194307   -.2867015
        2009  |  -.8161252   .1351418    -6.04   0.000    -1.081088   -.5511626
        2010  |  -.7621596   .1371852    -5.56   0.000    -1.031129   -.4931907
        2011  |  -.8598761   .1393605    -6.17   0.000     -1.13311   -.5866423
        2012  |  -.8850199   .1412354    -6.27   0.000     -1.16193   -.6081101
        2013  |  -.9783239   .1424856    -6.87   0.000    -1.257685   -.6989629
        2014  |  -1.145044   .1438095    -7.96   0.000       -1.427   -.8630869
        2015  |  -1.275628   .1454768    -8.77   0.000    -1.560854   -.9904025
              |
        _cons |  -11.78634   1.030743   -11.43   0.000    -13.80724   -9.765437
--------------+----------------------------------------------------------------
      sigma_u |  3.3655903
      sigma_e |  .95078342
          rho |  .92609147   (fraction of variance due to u_i)
-------------------------------------------------------------------------------
F test that all u_i=0:     F(158, 3582) =   243.28           Prob > F = 0.0000

. 
. xtreg co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", vc
> e(cluster c_code)

Random-effects GLS regression                   Number of obs      =      3773
Group variable: c_code                          Number of groups   =       159

R-sq:  within  = 0.1475                         Obs per group: min =         3
       between = 0.5900                                        avg =      23.7
       overall = 0.5745                                        max =        26

                                                Wald chi2(35)      =    315.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

                                (Std. Err. adjusted for 159 clusters in c_code)
-------------------------------------------------------------------------------
              |               Robust
        co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -.0279736   .3737039    -0.07   0.940    -.7604198    .7044726
      lngdppc |   1.713942   .3706472     4.62   0.000     .9874867    2.440397
        trade |  -.0040785   .0029616    -1.38   0.168    -.0098832    .0017261
          pop |   2.97e-10   1.33e-09     0.22   0.823    -2.31e-09    2.91e-09
        urban |   .0541958   .0160655     3.37   0.001     .0227081    .0856835
        renew |  -.0247274   .0063439    -3.90   0.000    -.0371612   -.0122937
       forest |  -.0174149   .0105448    -1.65   0.099    -.0380823    .0032525
       annexI |   .8201007   1.054827     0.78   0.437    -1.247323    2.887524
       island |   .3313513   .9058319     0.37   0.715    -1.444047    2.106749
     latitude |  -.0274382   .2497732    -0.11   0.913    -.5169847    .4621082
              |
         year |
        1991  |   .0098562   .0608528     0.16   0.871     -.109413    .1291254
        1992  |   .0030351   .1283371     0.02   0.981     -.248501    .2545713
        1993  |   .0281075    .129112     0.22   0.828    -.2249474    .2811624
        1994  |  -.0225875    .135137    -0.17   0.867    -.2874511    .2422761
        1995  |  -.0972238   .1397483    -0.70   0.487    -.3711255    .1766779
        1996  |  -.0945253    .145034    -0.65   0.515    -.3787866     .189736
        1997  |  -.1448129   .1492582    -0.97   0.332    -.4373536    .1477278
        1998  |  -.2426158   .1585872    -1.53   0.126    -.5534411    .0682094
        1999  |  -.3158956   .1671734    -1.89   0.059    -.6435496    .0117583
        2000  |  -.3285131   .1792978    -1.83   0.067    -.6799304    .0229042
        2001  |  -.3347247   .1906594    -1.76   0.079    -.7084103    .0389608
        2002  |  -.4181056   .1963628    -2.13   0.033    -.8029696   -.0332416
        2003  |  -.3336819    .210077    -1.59   0.112    -.7454252    .0780614
        2004  |  -.3339624   .2177822    -1.53   0.125    -.7608076    .0928829
        2005  |  -.3943811   .2218789    -1.78   0.075    -.8292559    .0404936
        2006  |  -.4296202   .2420377    -1.78   0.076    -.9040054    .0447649
        2007  |  -.5437249   .2478374    -2.19   0.028    -1.029477   -.0579725
        2008  |  -.5453375   .2479024    -2.20   0.028    -1.031217   -.0594577
        2009  |  -.8036644   .2592136    -3.10   0.002    -1.311714   -.2956151
        2010  |  -.7521856   .2685844    -2.80   0.005    -1.278601   -.2257699
        2011  |  -.8500024   .2739458    -3.10   0.002    -1.386926   -.3130785
        2012  |  -.8757411   .2742225    -3.19   0.001    -1.413207    -.338275
        2013  |  -.9700924   .2813273    -3.45   0.001    -1.521484    -.418701
        2014  |  -1.137268   .2977952    -3.82   0.000    -1.720936   -.5536006
        2015  |    -1.2678   .3187731    -3.98   0.000    -1.892583   -.6430158
              |
        _cons |  -11.99886    2.96945    -4.04   0.000    -17.81888   -6.178845
--------------+----------------------------------------------------------------
      sigma_u |  3.0108728
      sigma_e |  .95078342
          rho |  .90932311   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1) drop(i.year) append
output_co2fed.xml
dir : seeout

. 
. xtpcse co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", c
> orr(ar1) pairwise  
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])
(note: at least one disturbance covariance assumed 0, no common time periods
       between panels)

Prais-Winsten regression, correlated panels corrected standard errors (PCSEs)

Group variable:   c_code                        Number of obs      =      3773
Time variable:    year                          Number of groups   =       159
Panels:           correlated (unbalanced)       Obs per group: min =         3
Autocorrelation:  common AR(1)                                 avg =  23.72956
Sigma computed by pairwise selection                           max =        26
Estimated covariances      =     12720          R-squared          =    0.3294
Estimated autocorrelations =         1          Wald chi2(35)      =   1036.23
Estimated coefficients     =        36          Prob > chi2        =    0.0000

-------------------------------------------------------------------------------
              |           Panel-corrected
        co2pc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -1.223435   .2195148    -5.57   0.000    -1.653676   -.7931941
      lngdppc |   2.169479   .1676734    12.94   0.000     1.840845    2.498113
        trade |   -.001264   .0011645    -1.09   0.278    -.0035464    .0010185
          pop |   1.17e-09   3.89e-10     3.01   0.003     4.08e-10    1.93e-09
        urban |   .0334111   .0086025     3.88   0.000     .0165504    .0502717
        renew |  -.0233261   .0026231    -8.89   0.000    -.0284674   -.0181849
       forest |  -.0222852    .005564    -4.01   0.000    -.0331904   -.0113799
       annexI |   .8794851    .493052     1.78   0.074     -.086879    1.845849
       island |   .2195306   .4478891     0.49   0.624     -.658316    1.097377
     latitude |  -.0226012   .1844142    -0.12   0.902    -.3840464     .338844
              |
         year |
        1991  |   .0665191   .0505777     1.32   0.188    -.0326113    .1656496
        1992  |  -.0292268   .0700568    -0.42   0.677    -.1665355     .108082
        1993  |   .0402113   .0819345     0.49   0.624    -.1203772    .2007999
        1994  |    .020228   .0913669     0.22   0.825    -.1588478    .1993038
        1995  |   -.093812    .098939    -0.95   0.343    -.2877288    .1001048
        1996  |  -.0890128    .104114    -0.85   0.393    -.2930725    .1150468
        1997  |  -.1375402   .1099471    -1.25   0.211    -.3530324    .0779521
        1998  |  -.2235057   .1152758    -1.94   0.053    -.4494421    .0024307
        1999  |  -.2808989   .1205572    -2.33   0.020    -.5171865   -.0446112
        2000  |  -.2990718   .1256679    -2.38   0.017    -.5453762   -.0527673
        2001  |  -.3345626   .1277182    -2.62   0.009    -.5848857   -.0842395
        2002  |  -.4148768   .1318314    -3.15   0.002    -.6732616    -.156492
        2003  |  -.3327776   .1362166    -2.44   0.015    -.5997572    -.065798
        2004  |  -.3576161   .1416988    -2.52   0.012    -.6353407   -.0798915
        2005  |   -.439949    .146638    -3.00   0.003    -.7273541   -.1525438
        2006  |  -.4855607   .1520221    -3.19   0.001    -.7835185   -.1876029
        2007  |  -.6173412   .1573964    -3.92   0.000    -.9258326   -.3088499
        2008  |  -.6253867   .1629506    -3.84   0.000     -.944764   -.3060095
        2009  |  -.8400306   .1629291    -5.16   0.000    -1.159366   -.5206953
        2010  |  -.8100269   .1688985    -4.80   0.000    -1.141062   -.4789919
        2011  |  -.9113574   .1749652    -5.21   0.000    -1.254283   -.5684319
        2012  |  -.9434504   .1799731    -5.24   0.000    -1.296191   -.5907096
        2013  |  -1.040381   .1841655    -5.65   0.000    -1.401339    -.679423
        2014  |  -1.210104   .1882428    -6.43   0.000    -1.579053   -.8411546
        2015  |  -1.343251   .1904085    -7.05   0.000    -1.716444   -.9700569
              |
        _cons |  -14.48187   1.294893   -11.18   0.000    -17.01981   -11.94392
--------------+----------------------------------------------------------------
          rho |   .9486887
-------------------------------------------------------------------------------

. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1) drop(i.year) append
output_co2fed.xml
dir : seeout

. 
. xtscc co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", re
>  lag(4)
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      3773
Method: Random-effects GLS regression            Number of groups  =       159
Group variable (i): c_code                       Wald chi2(32)     = 892803.17
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.5745

-------------------------------------------------------------------------------
              |             Drisc/Kraay
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -.0279736   .2337195    -0.12   0.906    -.5093278    .4533806
      lngdppc |   1.713942    .185254     9.25   0.000     1.332404     2.09548
        trade |  -.0040785   .0016655    -2.45   0.022    -.0075087   -.0006483
          pop |   2.97e-10   6.20e-10     0.48   0.636    -9.79e-10    1.57e-09
        urban |   .0541958   .0069681     7.78   0.000     .0398448    .0685468
        renew |  -.0247274   .0040358    -6.13   0.000    -.0330392   -.0164156
       forest |  -.0174149   .0067817    -2.57   0.017     -.031382   -.0034478
       annexI |   .8201007   3.011644     0.27   0.788    -5.382497    7.022698
       island |   .3313513   .9542104     0.35   0.731    -1.633882    2.296584
     latitude |  -.0274382   .6325044    -0.04   0.966    -1.330106    1.275229
              |
         year |
        1990  |          0  (empty)
        1991  |   .0098562   .0238247     0.41   0.683    -.0392117    .0589241
        1992  |   .0030351    .044956     0.07   0.947    -.0895534    .0956236
        1993  |   .0281075    .053758     0.52   0.606    -.0826091    .1388241
        1994  |  -.0225875   .0569796    -0.40   0.695    -.1399392    .0947643
        1995  |  -.0972238   .0622794    -1.56   0.131    -.2254906     .031043
        1996  |  -.0945253   .0601493    -1.57   0.129    -.2184051    .0293546
        1997  |  -.1448129   .0593372    -2.44   0.022    -.2670201   -.0226058
        1998  |  -.2426158   .0583189    -4.16   0.000    -.3627258   -.1225058
        1999  |  -.3158956   .0580861    -5.44   0.000    -.4355261   -.1962652
        2000  |  -.3285131   .0540103    -6.08   0.000    -.4397494   -.2172768
        2001  |  -.3347247     .05582    -6.00   0.000    -.4496882   -.2197612
        2002  |  -.4181056   .0571268    -7.32   0.000    -.5357605   -.3004507
        2003  |  -.3336819   .0588244    -5.67   0.000     -.454833   -.2125309
        2004  |  -.3339624   .0592535    -5.64   0.000    -.4559972   -.2119275
        2005  |  -.3943811   .0600834    -6.56   0.000    -.5181251   -.2706371
        2006  |  -.4296202   .0626531    -6.86   0.000    -.5586567   -.3005838
        2007  |  -.5437249    .065546    -8.30   0.000    -.6787194   -.4087304
        2008  |  -.5453375    .067104    -8.13   0.000    -.6835406   -.4071343
        2009  |  -.8036644   .0710266   -11.31   0.000    -.9499463   -.6573825
        2010  |  -.7521856    .070505   -10.67   0.000    -.8973934   -.6069779
        2011  |  -.8500024   .0713903   -11.91   0.000    -.9970334   -.7029713
        2012  |  -.8757411   .0723538   -12.10   0.000    -1.024756   -.7267257
        2013  |  -.9700924   .0738275   -13.14   0.000    -1.122143   -.8180419
        2014  |  -1.137268   .0764166   -14.88   0.000    -1.294651   -.9798855
        2015  |    -1.2678   .0813851   -15.58   0.000    -1.435415   -1.100184
              |
        _cons |  -11.99886   1.760698    -6.81   0.000    -15.62509   -8.372636
--------------+----------------------------------------------------------------
      sigma_u |  3.0108728
      sigma_e |  .95078342
          rho |  .90932311   (fraction of variance due to u_i)
-------------------------------------------------------------------------------


. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1) drop(i.year) append
output_co2fed.xml
dir : seeout

. 
. drop v2x_partip v2x_partip_codelow v2x_partip_codehigh v2x_partip_sd v2x_cspart v2x_cspart_codelow v2x_cspart_codehigh v
> 2x_cspart_sd v2xdd_dd v2xel_locelec v2xel_locelec_codelow v2xel_locelec_codehigh v2xel_locelec_sd v2xel_regelec v2xel_re
> gelec_codelow v2xel_regelec_codehigh v2xel_regelec_sd v2xdl_delib v2xdl_delib_codelow v2xdl_delib_codehigh v2xdl_delib_s
> d v2x_egal v2x_egal_codelow v2x_egal_codehigh v2x_egal_sd v2xeg_eqprotec v2xeg_eqprotec_codelow v2xeg_eqprotec_codehigh 

. 
. xtscc co2pc v2x_polyarchy lngdppc trade pop urban renew forest annexI island latitude i.year if countryname!="Qatar", re
>  lag(4)
(16 missing values generated)

Regression with Driscoll-Kraay standard errors   Number of obs     =      3773
Method: Random-effects GLS regression            Number of groups  =       159
Group variable (i): c_code                       Wald chi2(32)     = 892803.17
maximum lag: 4                                   Prob > chi2       =    0.0000
corr(u_i, Xb) = 0 (assumed)                      overall R-squared =    0.5745

-------------------------------------------------------------------------------
              |             Drisc/Kraay
        co2pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
v2x_polyarchy |  -.0279736   .2337195    -0.12   0.906    -.5093278    .4533806
      lngdppc |   1.713942    .185254     9.25   0.000     1.332404     2.09548
        trade |  -.0040785   .0016655    -2.45   0.022    -.0075087   -.0006483
          pop |   2.97e-10   6.20e-10     0.48   0.636    -9.79e-10    1.57e-09
        urban |   .0541958   .0069681     7.78   0.000     .0398448    .0685468
        renew |  -.0247274   .0040358    -6.13   0.000    -.0330392   -.0164156
       forest |  -.0174149   .0067817    -2.57   0.017     -.031382   -.0034478
       annexI |   .8201007   3.011644     0.27   0.788    -5.382497    7.022698
       island |   .3313513   .9542104     0.35   0.731    -1.633882    2.296584
     latitude |  -.0274382   .6325044    -0.04   0.966    -1.330106    1.275229
              |
         year |
        1990  |          0  (empty)
        1991  |   .0098562   .0238247     0.41   0.683    -.0392117    .0589241
        1992  |   .0030351    .044956     0.07   0.947    -.0895534    .0956236
        1993  |   .0281075    .053758     0.52   0.606    -.0826091    .1388241
        1994  |  -.0225875   .0569796    -0.40   0.695    -.1399392    .0947643
        1995  |  -.0972238   .0622794    -1.56   0.131    -.2254906     .031043
        1996  |  -.0945253   .0601493    -1.57   0.129    -.2184051    .0293546
        1997  |  -.1448129   .0593372    -2.44   0.022    -.2670201   -.0226058
        1998  |  -.2426158   .0583189    -4.16   0.000    -.3627258   -.1225058
        1999  |  -.3158956   .0580861    -5.44   0.000    -.4355261   -.1962652
        2000  |  -.3285131   .0540103    -6.08   0.000    -.4397494   -.2172768
        2001  |  -.3347247     .05582    -6.00   0.000    -.4496882   -.2197612
        2002  |  -.4181056   .0571268    -7.32   0.000    -.5357605   -.3004507
        2003  |  -.3336819   .0588244    -5.67   0.000     -.454833   -.2125309
        2004  |  -.3339624   .0592535    -5.64   0.000    -.4559972   -.2119275
        2005  |  -.3943811   .0600834    -6.56   0.000    -.5181251   -.2706371
        2006  |  -.4296202   .0626531    -6.86   0.000    -.5586567   -.3005838
        2007  |  -.5437249    .065546    -8.30   0.000    -.6787194   -.4087304
        2008  |  -.5453375    .067104    -8.13   0.000    -.6835406   -.4071343
        2009  |  -.8036644   .0710266   -11.31   0.000    -.9499463   -.6573825
        2010  |  -.7521856    .070505   -10.67   0.000    -.8973934   -.6069779
        2011  |  -.8500024   .0713903   -11.91   0.000    -.9970334   -.7029713
        2012  |  -.8757411   .0723538   -12.10   0.000    -1.024756   -.7267257
        2013  |  -.9700924   .0738275   -13.14   0.000    -1.122143   -.8180419
        2014  |  -1.137268   .0764166   -14.88   0.000    -1.294651   -.9798855
        2015  |    -1.2678   .0813851   -15.58   0.000    -1.435415   -1.100184
              |
        _cons |  -11.99886   1.760698    -6.81   0.000    -15.62509   -8.372636
--------------+----------------------------------------------------------------
      sigma_u |  3.0108728
      sigma_e |  .95078342
          rho |  .90932311   (fraction of variance due to u_i)
-------------------------------------------------------------------------------


. 
. outreg2 using output_co2fed, dec(3) excel label alpha(0.001, 0.01, 0.05, 0.1) symbol(***, **, *, ^) addtext(Year FE, Yes
> ) ctitle(Model 1) drop(i.year) append
output_co2fed.xml
dir : seeout

. log close
      name:  <unnamed>
       log:  C:\Users\Muinul\Google Drive\Muinul\00_DISSERTATION\00_DISSERTATION_final\Supplemental Materials_Original\Log
>  file_Empirical Analysis_Final Version\Democracy\Log file_Democracy_V-dem_TSCS_Oct15,2020.log
  log type:  text
 closed on:  15 Oct 2020, 13:51:59
--------------------------------------------------------------------------------------------------------------------------
